[
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/DInfinityContributingArea.html",
    "name": "D-Infinity Contributing Area",
    "description": [
      "Calculates a  grid of specific catchment area which is the contributing area per unit  contour length using the multiple flow direction D-infinity approach.  D-infinity flow direction is defined as steepest downward slope on  planar triangular facets on a block centered grid. The contribution at  each grid cell is taken as the grid cell length (or when the optional  weight grid input is used, from the weight grid). The contributing area  of each grid cell is then taken as its own contribution plus the  contribution from upslope neighbors that have some fraction draining to  it according to the D-infinity flow model. The flow from each cell  either all drains to one neighbor, if the angle falls along a cardinal  (0, pi/2, pi, 3pi/2) or ordinal (pi/4, 3pi/4, 5pi/4, 7pi/4) direction,  or is on an angle falling between the direct angle to two adjacent  neighbors. In the latter case the flow is proportioned between these two  neighbor cells according to how close the flow direction angle is to  the direct angle to those cells. ",
      "Using  the grid cell size as the contribution at each grid cell assumes that  grid cell size is the effective contour length in the definition of  specific catchment area and does not distinguish any difference in  contour length dependent upon the flow direction. The resulting units of  the specific catchment area are then length units the same as those of  the grid cell size.",
      "If the    optional outlet point shapefile is used, only the outlet cells and the    cells upslope (by the D-infinity flow model) of them are in the domain    to be evaluated.",
      "By default    Dinfinity specific catchment area is evaluated using checks for edge    contamination. This is defined as the possibility that a contributing    area value may be underestimated due to grid cells outside of the domain   not being counted. This occurs when drainage is inwards from the    boundaries or areas with \"no data\" values for elevation. The algorithm    recognizes this and reports \"no data\" for the contributing area. It is    common to see streaks of \"no data\" values extending inwards from    boundaries along flow paths that enter the domain at a boundary. This is   the desired effect and indicates that contributing area for these grid    cells is unknown due to it being dependent on terrain outside of the    domain of data available. Edge contamination checking may be turned off    in cases where you know it is not an issue or want to ignore these    problems, if for example, the DEM has been clipped along a watershed    outline."
    ],
    "usage": "mpiexec -n <number of processes>  AreaDinf  -ang  < angfile >  -sca  <  scafile > [  -o  <outletfile>] [  -wg  <wgfile>] [  -nc ] [  -lyrname  <layer name>] [  -lyrno  <layer number>] angfile: Input Dinfflow directions grid scafile: Output Dinf contributing area grid outletfile: input outlets file (OGR readable dataset) wgfile: Input weight grid (optional) nc: Flag for edge contamination layer name: OGR layer name if outlets are not the first layer in outletfile (optional) layer number: OGR layer number if outlets are not the first layer in outletfile (optional) Layer name and layer number should not both be specified.",
    "syntax": "AreaDinf  (Input_D-Infinity_Flow_Direction_Grid, {Input_Outlets},  {Input_Weight_Grid}, Check_for_Edge_Contamination,  Input_Number_of_Processes,  Output_D-Infinity_Specific_Catchment_Area_Grid) ",
    "parameters": [
      {
        "parameterName": "Input_D-Infinity_Flow_Direction_Grid",
        "description": [
          "A  grid of flow directions based on the D-infinity flow method using the  steepest slope of a triangular facet (Tarboton, 1997, \"A New Method for  the Determination of Flow Directions and Contributing Areas in Grid  Digital Elevation Models,\" Water Resources Research, 33(2): 309-319).  Flow direction is determined as the direction of the steepest downward  slope on the 8 triangular facets of a 3 x 3 block centered grid. Flow  direction is encoded as an angle in radians, counter-clockwise from east  as a continuous (floating point) quantity between 0 and 2 pi. The  resulting flow in a grid is then usually interpreted as being  proportioned between the two neighboring cells that define the  triangular facet with the steepest downward slope."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Outlets (Optional)",
        "description": [
          "A  point feature defining the outlets of interest. If this input is used,  only the cells upslope of these outlet points are considered to be  within the domain being evaluated."
        ],
        "dataType": "Feature Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Weight_Grid (Optional)",
        "description": [
          "A  grid giving contribution to flow for each cell. These contributions  (also sometimes referred to as weights or loadings) are used in the  contributing area accumulation. If this input file is not used, the  result is reported in terms of specific catchment area (the upslope area  per unit contour length) taken as the number of cells times grid cell  length (cell area divided by cell length)."
        ],
        "dataType": "Raster Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_D-Infinity_Specific_Catchment_Area_Grid",
        "description": [
          "A  grid of specific catchment area which is the contributing area per unit  contour length using the multiple flow direction D-infinity approach.  The contributing area of each grid cell is then taken as its own  contribution plus the contribution from upslope neighbors that have some  fraction draining to it according to the D-infinity flow model."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Check_for_Edge_Contamination",
        "description": [
          "A  flag that indicates whether the tool should check for edge  contamination. Edge contamination is defined as the possibility that a  contributing area value may be underestimated due to the fact that grid  cells outside of the domain have not been evaluated. This occurs when  drainage is inwards from the boundaries or areas with \"no data\" values  for elevation. The algorithm recognizes this and reports \"no data\" for  the impated cells. It is common to see streaks of \"no data\" values  extending inwards from boundaries along flow paths that enter the domain  at a boundary. This is the desired effect and indicates that  contributing area for these grid cells is unknown due to it being  dependent on terrain outside of the domain of available data. Edge  contamination checking may be turned off in cases where you know this is  not an issue, or want to ignore these problems, if for example, the DEM  has been clipped along a watershed outline."
        ],
        "dataType": "Boolean",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "The  number of stripes that the domain will be divided into and the number  of MPI parallel processes that will be spawned to evaluate each of the  stripes."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/D8ExtremeUpslopeValue.html",
    "name": "D8 Extreme Upslope Value",
    "description": [
      "Evaluates the extreme (either maximum or minimum) upslope value  from an input grid based on the D8 flow model. This is intended initially for  use in stream raster generation to identify a threshold of the slope times area  product that results in an optimum (according to drop analysis) stream  network.",
      "If the optional outlet point shapefile is used, only the outlet  cells and the cells upslope (by the D8 flow model) of them are in the domain to  be evaluated.",
      "By default, the tool checks for edge contamination. This is defined as  the possibility that a result may be underestimated due to grid cells outside of  the domain not being counted. This occurs when drainage is inwards from the  boundaries or areas with no data values for elevation. The algorithm recognizes  this and reports \"no data\" for the result for these grid cells. It is common to  see streaks of \"no data\" values extending inwards from boundaries along flow  paths that enter the domain at a boundary. This is the desired effect and  indicates that the result for these grid cells is unknown due to it being  dependent on terrain outside of the domain of data available. Edge contamination  checking may be turned off in cases where you know this is not an issue or want  to ignore these problems, if for example, the DEM has been clipped along a  watershed outline."
    ],
    "usage": "mpiexec -n <number of processes>  D8FlowPathExtremeUp   -p <pfile>   -sa  <safile>   -ssa  < ssafile > [   -max ] [  -nc ]   [ -o  <outletfile>] [   -lyrname  <layer  name>] [  -lyrno   <layer number>] The default is maximum, that is switched to minimum if -min is  specified. pfile: File name for D8 flow direction grid (input) safile: File name for slopearea file (input). ssafile: File name for output grid with extreme upslope  value outletfile: input outlets file (OGR readable  dataset) nc: Flag for edge contamination layer name: OGR layer name if outlets are not the first layer in  outletfile (optional) layer number: OGR layer number if outlets are not the first layer  in outletfile (optional) Layer name and layer number should not both be  specified.",
    "syntax": "D8ExtremeUpslope (Input_D8_Flow_Direction_Grid,  Input_Value_Grid, Use_maximum_upslope_value, Check_for_edge_contamination,  {Input_Outlets}, Input_Number_of_Processes, Output_Extreme_Value_Grid)  ",
    "parameters": [
      {
        "parameterName": "Input_D8_Flow_Direction_Grid",
        "description": [
          "A grid of D8 flow directions which are defined, for each cell, as the direction of the one of its eight adjacent or diagonal neighbors with the steepest downward slope."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Value_Grid",
        "description": [
          "This is the grid of values of which the maximum or minimum upslope value is selected. The values most commonly used are the slope times area product needed when generating stream rasters according to drop analysis."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Outlets (Optional)",
        "description": [
          "A point feature defining outlets of interest. If this input feature  is used, only the area upslope of these outlets will be evaluated by the tool."
        ],
        "dataType": "Feature Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Extreme_Value_Grid",
        "description": [
          "A grid of the maximum/minimum upslope values."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Use_maximum_upslope_value",
        "description": [
          "A flag to indicate whether the maximum or minimum upslope value is to be calculated."
        ],
        "dataType": "Boolean",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Check_for_edge_contamination",
        "description": [
          "A flag that indicates whether the tool should check for edge contamination."
        ],
        "dataType": "Boolean",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "The number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each of the stripes."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/ConnectDown.html",
    "name": "ConnectDown",
    "description": [
      "For each zone in a raster entered (e.g. HUC converted to grid) it  identifies the point with largest AreaD8. This is taken to be the outlet. A OGR  file is created.Using flow directions each outlet is moved downflow a specified  number of grid cells which is user controllable (Default is 1). The ID of the  location the point has moved to is taken as iddown. Two OGR files are created  one with the initial points and one with the moved points. Both contain id,  iddown and AreaD8. "
    ],
    "usage": "mpiexec -n <number of processes>  ConnectDown -p  <pfile>  -ad8   <ad8file>  -w   <wfile>  -o   < outletfile > [   -olyr  outletlayername]   -od  < moved  outletfile > [  -odlyr   moved outlet layer name] [  -d ]  pfile: Input flow directions grid ad8file: Input contributing area grid wfile: Input Watershed grid  outletfile: Output outlets file (OGR writeable dataset) moved outletfile: Output moved outlets file (OGR writeable  dataset) outletlayername: OGR layer name in outletfile (optional) moved outlet layer name: OGR layer name in moved outletfile  (optional) d: number of grid cells move to downstream",
    "syntax": "ConnectDown (Input_D8_Flow_Direction_Grid,  Input_D8Contributing_Area_Grid, Input_Watershed_Grid,  Input_Number_of_Grid_Cells, Input_Number_of_Processes, Output_Outlets_file,  Output_MovedOutlets_file) ",
    "parameters": [
      {
        "parameterName": "Input_D8_Flow_Direction_Grid",
        "description": [
          "This input is a grid of flow directions that are encoded using the D8 method where all flow from a cells goes to a single neighboring cell in the direction of steepest descent. "
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_D8Contributing_Area_Grid",
        "description": [
          "A grid giving the contributing area value in terms of the number of grid cells (or the summation of weights) for each cell taken as its own contribution plus the contribution from upslope neighbors that drain in to it using the D8 algorithm. This is usually the output of the \"D8 Contributing Area\" tool."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Watershed_Grid",
        "description": [
          "Watershed grid delineated from gage watershed function or streamreachwatershed function. Other watershed  (e.g. HUC) raster also can be used as watershed grid."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Grid_Cells",
        "description": [
          "Number of grid cells move to downstream based on flow directions."
        ],
        "dataType": "Long",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Outlets_file",
        "description": [
          "This output is point a OGR file where each point is created from watershed grid having the largest contributing area for each zone."
        ],
        "dataType": "File",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_MovedOutlets_file",
        "description": [
          "This output is a point OGR file where each outlet is moved downflow a specified number of grid cells using flow directions."
        ],
        "dataType": "File",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "This input indicates the number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each piece of the domain."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/SlopeAreaCombination.html",
    "name": "Slope Area Combination",
    "description": [
      "Creates a grid of slope-area values = (S^m)(A^n) based on slope and  specific catchment area grid inputs, and parameters m and n. This tool is  intended for use as part of the slope-area stream raster delineation  method."
    ],
    "usage": "mpiexec -n <number of processes>  SlopeArea    -slp  <slpfile>  -sca  <scafile>  -sa   < safile > [   -par  2 1] The default parameter values of 2 and 1 are assumed unless -par is  specified. slpfile: File name for slope grid (generally from DinfFlowDir)  (input) scafile: File name for contributing area file (generally from AreaDinf)  (input). safile: File name for output grid with SmAn. Float. (output) par: Array of input parameters with p[0] being the slope exponent and  p[1] being the area exponent",
    "syntax": "SlopeAreaCombination (Input_Slope_Grid,  Input_Area_Grid, Slope_Exponent__m, Area_Exponent__n, Input_Number_of_Processes,  Output_Slope_Area_Grid) ",
    "parameters": [
      {
        "parameterName": "Input_Slope_Grid",
        "description": [
          "This input is a grid of slope values. This grid can be obtained from the \"D-Infinity Flow Directions\" tool."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Area_Grid",
        "description": [
          "A grid giving the specific catchment area for each cell taken as its own contribution (grid cell length or summation of weights) plus the proportional contribution from upslope neighbors that drain in to it. This grid is typically obtained from the \"D-Infinity Contributing Area\" tool."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Slope_Area_Grid",
        "description": [
          "A grid of slope-area values = (S^m)(A^n) calculated from the slope grid, specific catchment area grid, m slope exponent parameter, and n area exponent parameter."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Slope_Exponent__m",
        "description": [
          "The slope exponent (m) parameter which will be used in the formula: (S^m)(A^n), that is used to create the slope-area grid."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Area_Exponent__n",
        "description": [
          "The area exponent (n) parameter which will be used in the formula: (S^m)(A^n), that is used to create the slope-area grid."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "The number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each of the stripes."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/GageWatershed.html",
    "name": "GageWatershed",
    "description": [
      "Calculates Gage watersheds grid. Each grid cell is labeled with the  identifier (from column id) of the gage to which it drains directly without  passing through any other gages."
    ],
    "usage": "mpiexec -n <number of processes>  GageWatershed   -p  <pfile>   -gw  < gwfile >  [  -o  <outletfile>] [   -lyrname  <layer  name>] [  -lyrno   <layer number>] [  -id   idfile ] pfile: File name for D8 flow direction grid (input) gw: File name for gage watersheds grid (output) idfile: File name for text file giving watershed downslope connectivity  (output) outletfile: input outlets file (OGR readable  dataset) layer name: OGR layer name if outlets are not the first layer in  outletfile (optional) layer number: OGR layer number if outlets are not the first layer  in outletfile (optional) Layer name and layer number should not both be  specified.",
    "syntax": "GageWatershed (Input_D8_Flow_Direction_Grid,  Input_Gages_file, Input_Number_of_Processes, Output_GageWatershed,  {Output_Downstream_Identefier}) ",
    "parameters": [
      {
        "parameterName": "Input_D8_Flow_Direction_Grid",
        "description": [
          "A grid of D8 flow directions which are defined, for each cell, as the direction of the one of its eight adjacent or diagonal neighbors with the steepest downward slope."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Gages_file",
        "description": [
          "A point feature defining the gages to which watersheds will be delineated. This feature should have a colmun 'id'. Grid cells draining directly to each point in this feature will be labeled with this id."
        ],
        "dataType": "Feature Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_GageWatershed",
        "description": [
          "This output grid identifies each gage watershed. Each grid cell is labeled with the identifier (from column id) of the gage to which it drains directly without passing through any other gages."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Downstream_Identefier (Optional)",
        "description": [
          "Text file giving watershed downslope connectivity"
        ],
        "dataType": "File",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "The number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each of the stripes."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/PeukerDouglas.html",
    "name": "Peuker Douglas",
    "description": [
      "Creates an indicator grid (1,0) of upward curved grid cells  according to the Peuker and Douglas algorithm.",
      "With this tool, the DEM is first smoothed by a kernel with  weights at the center, sides, and diagonals. The Peuker and Douglas (1975)  method (also explained in Band, 1986), is then used to identify upwardly curving  grid cells. This technique flags the entire grid, then examines in a single pass  each quadrant of 4 grid cells, and unflags the highest. The remaining flagged  cells are deemed 'upwardly curved', and when viewed, resemble a channel network.  This proto-channel network generally lacks connectivity and requires thinning,  issues that were discussed in detail by Band (1986).",
      "Band, L. E., (1986), \"Topographic partition of watersheds with  digital elevation models,\" Water Resources Research, 22(1): 15-24.  ",
      "Peuker, T. K. and D. H. Douglas, (1975), \"Detection of surface-specific  points by local parallel processing of discrete terrain elevation data,\" Comput.  Graphics Image Process., 4: 375-387. "
    ],
    "usage": "mpiexec -n <number of processes>  PeukerDouglas      -fel   <felfile>  -ss   < ssfile >   -par  0.4 0.1  0.05 felfile: File name for float grid of elevations (input) ssfile: File name for short indicator grid of upward curved grid cells,  by Peuker and Douglas par: float array of parameters used to smooth DEM, p[0] being center  weight, p[1] side weight, p[2] being diagonal weight.",
    "syntax": "PeukerDouglas (Input_Elevation_Grid,  Center_Smoothing_Weight, Side_Smoothing_Weight, Diagonal_Smoothing_Weight,  Input_Number_of_Processes, Output_Stream_Source_Grid) ",
    "parameters": [
      {
        "parameterName": "Input_Elevation_Grid",
        "description": [
          "A grid of elevation values. This is usually the output of the \"Pit Remove\" tool, in which case it is elevations with pits removed."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Stream_Source_Grid",
        "description": [
          "An indicator grid (1,0) of upward curved grid cells according to the Peuker and Douglas algorithm, and if viewed, resembles a channel network. This proto-channel network generally lacks connectivity and requires thinning, issues that were discussed in detail by Band (1986)."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Center_Smoothing_Weight",
        "description": [
          "The center weight parameter used by a kernel to smooth the DEM before the tool identifies upwardly curved grid cells."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Side_Smoothing_Weight",
        "description": [
          "The side weight parameter used by a kernel to smooth the DEM before the tool identifies upwardly curved grid cells."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Diagonal_Smoothing_Weight",
        "description": [
          "The diagonal weight parameter used by a kernel to smooth the DEM before the tool identifies upwardly curved grid cells."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "The number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each of the stripes."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/LengthAreaStreamSource.html",
    "name": "Length Area Stream Source",
    "description": [
      "Creates an indicator grid (1,0) that evaluates A >= (M)(L^y) based  on upslope path length, D8 contributing area grid inputs, and parameters M and  y. This grid indicates likely stream source grid cells. This is an experimental  method with theoretical basis in Hack's law which states that for streams L ~  A^0.6. However for hillslopes with parallel flow L ~ A. So a transition from  hillslopes to streams may be represented by L ~ A^0.8 suggesting identifying  grid cells as stream cells if A > M (L^(1/0.8))."
    ],
    "usage": "mpiexec -n <number of processes>   LengthArea  -plen   <plenfile>  -ad8   <ad8file>  -ss   < ssfile >   [- par  0.03  1.3]  The default parameter values of 0.03 and 1.3 are assumed unless -par is  specified. plenfile: File name for longest upslope path grid (generally from  Gridnet) (input) ad8file: File name for contributing area file (generally from AreaD8)  (input). ssfile: File name for indicator (1,0) output grid with A >= M L^y.  Short. (output) par: Array of input parameters with p[0] being M coefficient and p[1]  being the y exponent on length",
    "syntax": "LengthAreaStreamSource (Input_Length_Grid,  Input_Contributing_Area_Grid, Threshold__M, Exponent__y,  Input_Number_of_Processes, Output_Stream_Source_Grid) ",
    "parameters": [
      {
        "parameterName": "Input_Length_Grid",
        "description": [
          "A grid of the maximum upslope length for each cell. This is calculated as the length of the flow path from the furthest cell that drains to each cell. Length is measured between cell centers taking into account cell size and whether the direction is adjacent or diagonal. It is this length (L) that is used in the formula, A >(M)(L^y), to determine which cells are considered stream cells. This grid can be obtained as an output from the \"Grid Network\" tool."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Contributing_Area_Grid",
        "description": [
          "A grid of contributing area values for each cell that were calculated using the D8 algorithm. The contributing area for a cell is the sum of its own contribution plus the contribution from all upslope neighbors that drain to it, measured as a number of cells. This grid is typically obtained as the output of the \"D8 Contributing Area\" tool. In this tool, it is the contributing area (A) that is compared in the formula A > ML^y to determine the transition to a stream."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Stream_Source_Grid",
        "description": [
          "An indicator grid (1,0) that evaluates A >= (M)(L^y), based on the maximum upslope path length, the D8 contributing area grid inputs, and parameters M and y. This grid indicates likely stream source grid cells."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Threshold__M",
        "description": [
          "The multiplier threshold (M) parameter which is used in the formula: A > (M)(L^y), to identify the beginning of streams."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Exponent__y",
        "description": [
          "The exponent (y) parameter which is used in the formula: A > (M)(L^y), to identify the beginning of streams. In branching systems, Hack's law suggests that L = 1/M A^(1/y) with 1/y = 0.6 (or 0.56) (y about 1.7). In parallel flow systems L is proportional to A (y about 1). This method tries to identify the transition between these two paradigms by using an exponent y somewhere inbetween (y about 1.3)."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "The number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each of the stripes."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/MoveOutletsToStreams.html",
    "name": "Move Outlets To Streams",
    "description": [
      "Moves outlet points that are not aligned with a stream cell from a  stream raster grid, downslope along the D8 flow direction until a stream raster  cell is encountered, the max_dist number of grid cells are examined, or the flow  path exits the domain (i.e. a \"no data\" value is encountered for the D8 flow  direction). The output file is a new point OGR file where each point has been  moved to coincide with the stream raster grid, if possible. A field 'dist_moved'  is added to the new outlets file to indicate the changes made to each point.  Points that are already on a stream cell are not moved and their 'dist_moved'  field is assigned a value 0. Points that are initially not on a stream cell are  moved by sliding them downslope along the D8 flow direction until one of the  following occurs: a.) A stream raster grid cell is encountered before traversing  the max_dist number of grid cells. In which case, the point is moved and the  'dist_moved' field is assigned a value indicating how many grid cells the point  was moved. b.) More than the max_number of grid cells are traversed, or c) the  traversal ends up going out of the domain (i.e., a \"no data\" D8 flow direction  value is encountered). In which case, the point is not moved and the  'dist_moved' field is assigned a value of -1."
    ],
    "usage": "mpiexec -n <number of processes>  MoveOutletsToStreams   -p  <pfile>   -src  <srcfile>   -o  <outletfile> [   -lyrname  <layer  name>] [  -lyrno   <layer number>]  -om   < movedoutletsfile >  [  -omlyr  omlayername] [   -md   maxdist] Note that if the -md flag and max_dist parameter is not given, the  default of 50 is used. pfile: File name for D8 flow direction grid (input) srcfile: File name for stream raster grid (input) maxdist : maximum number of grid cells to traverse in moving outlet  points (input) outletfile: input outlets file (OGR readable dataset) layer name: OGR layer name if outlets are not the first layer in  outletfile (optional) layer number: OGR layer number if outlets are not the first layer  in outletfile (optional) Layer name and layer number should not both be specified. movedoutletsfile: Output OGR file where outlets have been  moved omlayername: layer name in movedoutletsfile (Optional)",
    "syntax": "MoveOutletsToStreams  (Input_D8_Flow_Direction_Grid, Input_Stream_Raster_Grid, Input_Outlets,  Input_Maximum_Distance, Input_Number_of_Processes, Output_Outlets_file)  ",
    "parameters": [
      {
        "parameterName": "Input_D8_Flow_Direction_Grid",
        "description": [
          "This input is a grid of flow directions that are encoded using the D8 method where all flow from a cells goes to a single neighboring cell in the direction of steepest descent. "
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Stream_Raster_Grid",
        "description": [
          "This output is an indicator grid (1,0) that indicates the location of streams, with a value of 1 for each of the stream cells and 0 for the remainder of the cells. This file is produced by several different tools in the \"Stream Network Analysis\" toolset."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Outlets",
        "description": [
          "A point feature defining points of interest or outlets that should ideally be located on a stream, but may not be exactly on the stream due to the fact that the feature point locations may not have been accurately registered with respect to the stream raster grid."
        ],
        "dataType": "Feature Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Maximum_Distance",
        "description": [
          "This input paramater is the maximum number of grid cells that the points in the input outlet feature  will be moved before they are saved to the output outlet feature."
        ],
        "dataType": "Double",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Outlets_file",
        "description": [
          "A point  OGR file defining points of interest or outlets. This output has one point in it for each point in the input outlet feature. If the original point was located on a stream, then the point was not moved. If the origianl point was not on a stream, the point was moved downslope according to the D8 flow direction until it reached a stream or the maximum distance had been reached. This file has an additional field \"dist_moved\" added to it which is the number of cells that the point was moved. This field is 0 if the cell was originally on a stream, -1 if it was not moved becuase there was not a stream within the maximum distance, or some positive value if it was moved."
        ],
        "dataType": "File",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "This input indicates the number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each piece of the domain."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/PeukerDouglasStreamDefinition.html",
    "name": "Peuker Douglas Stream Definition",
    "description": [
      "This tool combines the functionality of the \"Peuker Douglas,\" \"D8  Contributing Area,\" \"Stream Drop Analysis,\" and \"Stream Definition by Threshold\"  tools in order to generate a stream indicator grid (1,0) where the streams are  located using a DEM curvature-based method. With this method, the DEM is first  smoothed by a kernel with weights at the center, sides, and diagonals. The  Peuker and Douglas (1975) method (also explained in Band, 1986), is then used to  identify upwardly curving grid cells. This technique flags the entire grid, then  examines in a single pass each quadrant of 4 grid cells, and unflags the  highest. The remaining flagged cells are deemed 'upwardly curved', and when  viewed, resemble a channel network. This proto-channel network sometimes lacks  connectivity, and/or requires thinning, issues that were discussed in detail by  Band (1986). The thinning and connecting of these grid cells is achieved here by  computing the D8 contributing area using only these upwardly curving cells. An  accumulation threshold on the number of these cells is then used to map the  channel network where this threshold is optionally set by the user, or  determined via drop analysis.",
      "If drop analysis is used, then instead of providing a value for the  accumulation threshold, the accumulation threshold value is determined by  searching the range between the Drop Analysis Parameters \"Lowest\" and \"Highest\",  using the number of steps in the parameter \"Number\". For the science behind drop  analysis, see Tarboton, et al. (1991, 1992), and Tarboton and Ames (2001). The  value of accumulation threshold that is selected is the smallest value where the  absolute value of the t-statistic is less than 2. This is written to the drop  analysis table text file. Drop analysis is only possible when outlets have been  specified, because if an entire grid domain is analyzed, as the threshold  varies, shorter streams draining off the edge may not meet the threshold  criterion and be excluded from the analysis. This makes defining drainage  density problematic and it is somewhat inconsistent to compare statistics  evaluated over differing domains."
    ],
    "usage": "There is no usage for this tool.",
    "syntax": "PeukerDouglasStreamDef (Input_Elevation_Grid,  Input_D8_Flow_Direction_Grid, Weight_Center, Weight_Side, Weight_Diagonal,  Accumulation_Threshold, Check_for_Edge_Contamination, {Input_Outlets},  {Input_Mask_Grid}, {Input_D8_Contributing_Area_for_Drop_Analysis},  Input_Number_of_Processes, Output_Stream_Source_Grid,  Output_Accumulated_Stream_Source_Grid, Output_Stream_Raster_Grid,  {Output_Drop_Analysis_Table},  Use_the_range_below_to_automatically_select_threshold_by_drop_analysis,  Minimum_Threshold_Value, Maximum_Threshold_Value, Number_of_Threshold_Values,  Use_Logarithmic_spacing_for_threshold_values) ",
    "parameters": [
      {
        "parameterName": "Input_Elevation_Grid",
        "description": [
          "This input is a grid of elevation values. As a general rule, it is recommended that you use a grid of elevation values that have had the pits removed for this input. Pits are generally taken to be artifacts that interfere with the analysis of flow across them. This grid can be obtained as the output of the \"Pit Remove\" tool, in which case it contains elevation values where the pits have been filled to the point where they just drain."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_D8_Flow_Direction_Grid",
        "description": [
          "This input is a grid of flow directions that are encoded using the D8 method where all flow from a cells goes to a single neighboring cell in the direction of steepest descent."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Outlets (Optional)",
        "description": [
          "This optional input is a point feature  defining the outlets of interest. If this input is used, the tool will only evaluate the area upslope of these outlets. If drop analysis is being used, this file must be provided."
        ],
        "dataType": "Feature Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Mask_Grid (Optional)",
        "description": [
          "This optional input is a grid that is used to mask the domain of interest and output is only provided where this grid is valid, i.e. does not contain a no-data value and whose value is greater than 0. A common use of this input is to use a D-infinity contributing area grid as the mask so that the delineated stream network is constrained to areas where D-infinity contributing area is available, replicating the functionality of an edge contamination mask."
        ],
        "dataType": "Raster Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_D8_Contributing_Area_for_Drop_Analysis (Optional)",
        "description": [
          "This input is a grid of contributing area values for each cell that were calculated using the D8 algorithm. The contributing area for a cell is the sum of its own contribution plus the contribution from all upslope neighbors that drain to it, measured as a number of cells or the sum of weight loadings. This grid can be obtained as the output of the \"D8 Contributing Area\" tool. If drop analysis is being used, this file must be provided as it is used to evaluate drainage density."
        ],
        "dataType": "Raster Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Stream_Source_Grid",
        "description": [
          "This output is an indicator grid (1,0) of upward curved grid cells according to the Peuker and Douglas algorithm, and if viewed, resembles a channel network. This proto channel network generally lacks connectivity and requires thinning, issues that were discussed in detail by Band (1986)."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Accumulated_Stream_Source_Grid",
        "description": [
          "This output grid is the accumulated area in the D8 direction of just the upwardly curved grid cells that were determined according to the Peuker and Douglas algorithm. This accumulation serves to thin and connect the proto channel network defined in the output strean source grid."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Stream_Raster_Grid",
        "description": [
          "This output is an indicator grid (1,0) that indicates the location of streams, with a value of 1 for each of the stream cells and 0 for the remainder of the cells."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Drop_Analysis_Table (Optional)",
        "description": [
          "This output is a comma delimited text file with the following header line:",
          "Threshold, DrainDen, NoFirstOrd, NoHighOrd, MeanDFirstOrd, MeanDHighOrd, StdDevFirstOrd, StdDevHighOrd, T",
          "The file then contains one line of data for each threshold value examined, and then a summary line that indicates the optimum threshold value. This technique looks for the smallest threshold in the range where the absolute value of the t-statistic is less than 2. For the science behind the drop analysis see Tarboton et al. (1991, 1992), Tarboton and Ames (2001). This output is only generated if drop analysis is used."
        ],
        "dataType": "File",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Weight_Center",
        "description": [
          "This input is the center weight used by a kernel to smooth the DEM before the tool identifies upwardly curved grid cells."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Weight_Side",
        "description": [
          "This input is the side weight used by a kernel to smooth the DEM before the tool identifies upwardly curved grid cells."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Weight_Diagonal",
        "description": [
          "This input is the diagonal weight used by a kernel to smooth the DEM before the tool identifies upwardly curved grid cells."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Accumulation_Threshold",
        "description": [
          "This input is used as the accumulation threshold on the number of upwardly curved cells, that is used to identify the beginning of streams. This value must be provided unless drop analysis is used."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Check_for_Edge_Contamination",
        "description": [
          "This flag determines whether the tool should check for edge contamination. Edge contamination is defined as the possibility that a value may be underestimated due to grid cells outside of the domain not being considered when determining contributing area. This occurs when drainage is inwards from the boundaries or areas with no data values for elevation. The algorithm recognizes this possibility and reports no data for the contributing area value. It is common to see streaks of no data values extending inwards from boundaries along flow paths that enter the domain at a boundary. This is the desired effect, and indicates that values for these grid cells is unknown due to it being dependent on terrain outside of the available data. Edge contamination checking may be overridden in cases where you know it is not an issue, or want to ignore the problems, if for example, the DEM has been clipped along a watershed outline."
        ],
        "dataType": "Boolean",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "This input indicates the number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each piece of the domain."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Use_the_range_below_to_automatically_select_threshold_by_drop_analysis",
        "description": [
          "This flag indicates whether drop analysis should be used to determine the optimal accumulation threshold value. Otherwise, the accumulation threshold parameter above will be used."
        ],
        "dataType": "Boolean",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Minimum_Threshold_Value",
        "description": [
          "This value is the lowest end of the range searched for possible threshold values using drop analysis. This technique looks for the smallest threshold in the range where the absolute value of the t-statistic is less than 2. For the science behind the drop analysis see Tarboton et al. (1991, 1992), Tarboton and Ames (2001)."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Maximum_Threshold_Value",
        "description": [
          "This value is the highest end of the range searched for possible threshold values using drop analysis. This technique looks for the smallest threshold in the range where the absolute value of the t-statistic is less than 2. For the science behind the drop analysis see Tarboton et al. (1991, 1992), Tarboton and Ames (2001)."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Number_of_Threshold_Values",
        "description": [
          "The number of steps to divide the search range into when looking for possible threshold values using drop analysis. This technique looks for the smallest threshold in the range where the absolute value of the t-statistic is less than 2. For the science behind the drop analysis see Tarboton et al. (1991, 1992), Tarboton and Ames (2001)."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Use_Logarithmic_spacing_for_threshold_values",
        "description": [
          "This flag indicates whether a logarithmic or linear spacing should be used when looking for possible threshold values using drop ananlysis."
        ],
        "dataType": "Boolean",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/SlopeAreaStreamDefinition.html",
    "name": "Slope Area Stream Definition",
    "description": [
      "This tool combines the function of the following tools: \"Slope Area  Combination,\" \"D8 Extreme Upslope Value,\" \"Stream Drop Analysis,\" and \"Stream  Definition by Threshold.\" It creates a grid where stream cells have a value of 1  and non-stream cells have a value of 0 using the area and slope threshold method  to determine the location of the streams. With this method, streams are defined  as beginning where an expression meets or exceeds a threshold (T). The  expression is calculated by taking the slope (S) raised to an exponent (m) and  then multiplied by the specific catchment area (a) raised to an exponent (n),  i.e, (S^m)(a^n) >= T. Once a stream begins, it continues downslope, from  there. This method was suggested by Montgomery and Dietrich (1992). (They used  the slope exponent (m) of 2, area exponent (n) of 1, and a threshold (T) of 200  m^2 in their study). Please note that specific catchment area (a) is the  contributing area per unit width (cell size) and has units of length. If  specific catchment area is used for A, the units are contributing area per unit  width (cell size), usually in m, so if the cell size is 15 m, a T equivalent to  200 m^2 is 200/15=13.3."
    ],
    "usage": "There is no usage for this tool.",
    "syntax": "SlopeAreaStreamDef (Input_D8_Flow_Direction_Grid,  Input_D-Infinity_Contributing_Area_Grid, Input_Slope_Grid, {Input_Mask_Grid},  {Input_Outlets}, {Input_Pit_Filled_Elevation_Grid_for_Drop_Analysis},  {Input_D8_Contributing_Area_Grid_for_Drop_Analysis},  Check_for_Edge_Contamination, Slope_Exponent__m, Area_Exponent__n, Threshold__T,  Input_Number_of_Processes, Output_Stream_Raster_Grid, Output_Slope-Area_Grid,  Output_Maximum_Upslope_Grid, {Output_Drop_Analysis_Table},  Use_the_range_below_to_automatically_select_threshold_by_drop_analysis,  Minimum_Threshold_Value, Maximum_Threshold_Value, Number_of_Threshold_Values,  Use_Logarithmic_spacing_for_threshold_values) ",
    "parameters": [
      {
        "parameterName": "Input_D8_Flow_Direction_Grid",
        "description": [
          "This input is a grid of flow directions that are encoded using the D8 method where all flow from a cells goes to a single neighboring cell in the direction of steepest descent. "
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_D-Infinity_Contributing_Area_Grid",
        "description": [
          "A grid giving the specific catchment area value for each cell taken as its own contribution (grid cell length or summation of weights) plus the proportional contribution from upslope neighbors that drain in to it. This grid is typically obtained using the D-infinity multiple flow direction method that is used by the \"D-Infinity Contributing Area\" tool. In this tool, it is this area (a) that is used in the formula (S^m)(a^n) >= T to determine the transition to a stream."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Slope_Grid",
        "description": [
          "This input is a grid of slope values. This is measured as drop/distance and it is most often obtained as the output of the \"D-Infinity Flow Direction\" tool. In this tool, it is this slope (S) that is used in the formula (S^m)(a^n) >= T to determine the transition to a stream."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Mask_Grid (Optional)",
        "description": [
          "This optional input is a grid that is used to mask the domain of interest and output is only provided where this grid is valid, i.e. does not contain a no-data value and whose value is greater than 0. A common use of this input is to use a D-infinity contributing area grid as the mask so that the delineated stream network is constrained to areas where D-infinity contributing area is available, replicating the functionality of an edge contamination mask."
        ],
        "dataType": "Raster Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Outlets (Optional)",
        "description": [
          "This optional input is a point feature  defining the outlets of interest. If this input is used, the tool will only evaluate the area upslope of these outlets."
        ],
        "dataType": "Feature Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Pit_Filled_Elevation_Grid_for_Drop_Analysis (Optional)",
        "description": [
          "This input is a grid of elevation values. As a general rule, it is recommended that you use a grid of elevation values that have had the pits removed for this input. Pits are generally taken to be artifacts that interfere with the analysis of flow across them. This grid can be obtained as the output of the \"Pit Remove\" tool, in which case it contains elevation values where the pits have been filled to the point where they just drain. This grid is only needed if drop analysis is being performed and is used to evaluate elevation drops along streams."
        ],
        "dataType": "Raster Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_D8_Contributing_Area_Grid_for_Drop_Analysis (Optional)",
        "description": [
          "This input is a grid of contributing area values for each cell that were calculated using the D8 algorithm. The contributing area for a cell is the sum of its own contribution plus the contribution from all upslope neighbors that drain to it, measured as a number of cells or the sum of weight loadings. This grid can be obtained as the output of the \"D8 Contributing Area\" tool. This input is required only when using drop analysis and is used to evaluate drainage density."
        ],
        "dataType": "Raster Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Stream_Raster_Grid",
        "description": [
          "This output is an indicator grid (1,0) that indicates the location of streams, with a value of 1 for each of the stream cells and 0 for the remainder of the cells."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Slope-Area_Grid",
        "description": [
          "This output grid contains the value of (S^m)*(a^n) for each grid cell."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Maximum_Upslope_Grid",
        "description": [
          "This output grid contains the maximum value of the Slope-Area grid upslope of each grid cell in the domain using D8 flow directions."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Drop_Analysis_Table (Optional)",
        "description": [
          "This output is a comma delimited text file with the following header line:",
          "Threshold, DrainDen, NoFirstOrd, NoHighOrd, MeanDFirstOrd, MeanDHighOrd, StdDevFirstOrd, StdDevHighOrd, T",
          "The file then contains one line of data for each threshold value examined, and then a summary line that indicates the optimum threshold value. This technique looks for the smallest threshold in the range where the absolute value of the t-statistic is less than 2. For the science behind the drop analysis see Tarboton et al. (1991, 1992), Tarboton and Ames (2001). This output is only generated if drop analysis is used."
        ],
        "dataType": "Text File",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Check_for_Edge_Contamination",
        "description": [
          "This flag determines whether the tool should check for edge contamination. Edge contamination is defined as the possibility that a value may be underestimated due to grid cells outside of the domain not being considered when determining contributing area. This occurs when drainage is inwards from the boundaries or areas with no data values for elevation. The algorithm recognizes this possibility and reports no data for the contributing area value. It is common to see streaks of no data values extending inwards from boundaries along flow paths that enter the domain at a boundary. This is the desired effect, and indicates that values for these grid cells is unknown due to it being dependent on terrain outside of the available data. Edge contamination checking may be overridden in cases where you know it is not an issue, or want to ignore the problems, if for example, the DEM has been clipped along a watershed outline."
        ],
        "dataType": "Boolean",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Slope_Exponent__m",
        "description": [
          "This input parameter is used as the slope exponent (m) in the formula: (S^m)*(a^n) >= T, that is used to identify the beginning of streams."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Area_Exponent__n",
        "description": [
          "This input parameter is used as the area exponent (n) in the formula: (S^m)*(a^n) >= T, that is used to identify the beginning of streams."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Threshold__T",
        "description": [
          "This optional input value is used as the threshold (T) in the formula: (S^m)*(a^n) >= T, that is used to identify the beginning of streams. This value must be provided unless drop analysis is used."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "This input indicates the number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each piece of the domain."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Use_the_range_below_to_automatically_select_threshold_by_drop_analysis",
        "description": [
          "This flag indicates whether drop analysis should be used to determine the optimal accumulation threshold value. Otherwise, the accumulation threshold parameter above will be used."
        ],
        "dataType": "Boolean",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Minimum_Threshold_Value",
        "description": [
          "This value is the lowest end of the range searched for possible threshold values using drop analysis. This technique looks for the smallest threshold in the range where the absolute value of the t-statistic is less than 2. For the science behind the drop analysis see Tarboton et al. (1991, 1992), Tarboton and Ames (2001)."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Maximum_Threshold_Value",
        "description": [
          "This value is the highest end of the range searched for possible threshold values using drop analysis. This technique looks for the smallest threshold in the range where the absolute value of the t-statistic is less than 2. For the science behind the drop analysis see Tarboton et al. (1991, 1992), Tarboton and Ames (2001)."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Number_of_Threshold_Values",
        "description": [
          "The number of steps to divide the search range into when looking for possible threshold values using drop analysis. This technique looks for the smallest threshold in the range where the absolute value of the t-statistic is less than 2. For the science behind the drop analysis see Tarboton et al. (1991, 1992), Tarboton and Ames (2001)."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Use_Logarithmic_spacing_for_threshold_values",
        "description": [
          "This flag indicates whether a logarithmic or linear spacing should be used when looking for possible threshold values using drop ananlysis."
        ],
        "dataType": "Boolean",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/StabilityIndex.html",
    "name": "Stability Index",
    "description": [
      "Computes terrain stability index (SI) using the SINMAP method based on  the infinite plain slope stability model. SI values are written to the output  raster file. Refer to documentation on ",
      "for an understanding of what this program does. Refer  also to documentation on the ",
      "for use of this including the impacts of roads on  drainage that may alter terrain stability."
    ],
    "usage": "Command Line Options: 1. Python program that takes input from a control file StabilityIndex.py --params <control file> Control file format # input parameters for combined stability index computation with road  impact # input files slp=<Slope grid> sca=<Specific catchment area grid> cal=<Region grid> calpar=<parameter attribute table> # output files si=<Stability index grid> sat=<Saturation grid> # Additional parameters minimumterrainrecharge=0.0009  # m/hr maximumterrainrecharge=0.00135 # m/hr # temporary output file directory temporary_output_files_directory=<directory> is_delete_intermediate_output_files=<Boolean> 2. Direct command line call mpiexec –n <number of processes> SinmapSI -slp <Slope grid>  -sca <Specific catchment area grid> -calpar <parameter attribute  table> -cal <Region grid> -si <Stability index grid> -sat  <Saturation grid> -par 0.0009 0.00135 9.81 1000",
    "syntax": "ArcGISStabilityIndex (Input_Slope_Raster,  Input_Specific_Catchment_Area_Raster, Input_Parameter_Region_Raster,  Input_Parameter_Attribute_Table_Text_File, Minimum_Terrain_Recharge__m_hr_,  Maximum_Terrain_Recharge__m_hr_, Output_Stability_Index_Raster,  Output_Saturation_Raster, Intermediate_Output_Files_Location,  Delete_Intermediate_Output_Files_Upon_Completion) ",
    "parameters": [
      {
        "parameterName": "Input_Slope_Raster",
        "description": [
          "A grid of terrain slope expressed as as drop/distance, i.e. tan of the slope angle. This is recommended to be from the TauDEM D-infinity flow directions function using the method described in Tarboton, D. G., (1997), \"A New Method for the Determination of Flow Directions and Contributing Areas in Grid Digital Elevation Models,\" Water Resources Research, 33(2): 309-319. This is the steepest outwards slope on one of eight triangular facets centered at each grid cell."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Specific_Catchment_Area_Raster",
        "description": [
          "A grid of specific catchment area which is the contributing area per unit contour length using the multiple flow direction D-infinity approach. The contributing area of each grid cell is then taken as its own contribution plus the contribution from upslope neighbors that have some fraction draining to it according to the D-infinity flow model. Recommend use the TauDEM Dinfinity contributing area function to obtain this."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Parameter_Region_Raster",
        "description": [
          "An integer valued raster defining parameter regions. This should have dimensions exactly the same as the input raster, and an accompanying attribute table that specifies SINMAP parameters for each value of this raster. The Create Parameter Region Tool is provided to create this raster."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Parameter_Attribute_Table_Text_File",
        "description": [
          "A comma separated attribute table with one row of parameters for each value in the parameter region grid. ",
          "Example format:",
          "SiID,tmin,tmax,cmin,cmax,phimin,phimax,SoilDens",
          "1,2.708,2.708,0.0,0.25,30.0,45.0,2000.0",
          "2,2.208,2.508,1.0,0.25,30.0,45.0,2000.0",
          "Columns are",
          "SiID - Identifier",
          "tmin - Transmissivity lower bound  (m^2/hr)",
          "tmax - Transmissivity upper bound  (m^2/hr)",
          "cmin - Dimensionless cohesion lower bound",
          "cmax - Dimensionless cohesion upper bound",
          "phimin - Soil friction angle lower bound",
          "phimax - Soil friction angle upper bound",
          "SoilDens - Soil density (kg/m^3)"
        ],
        "dataType": "File",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Stability_Index_Raster",
        "description": [
          "SINMAP stability index. ",
          "Stability index values are 0.0 or greater, with values greater than 1.0 indicating some level of stability."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Saturation_Raster",
        "description": [
          "This raster encodes the topographic wetness index described in the SINMAP documentation. Given the range of R/T values there are 3 possibilities:",
          "w is 1 (saturated) for the   full range (R/T_min, R/T_max). ",
          "w is 1 for part of the range   (R/T_min, R/T_max).",
          "w is never   1.",
          "These are used to assign one of the following values to each grid cell in the saturation theme. ",
          "Saturation Zone",
          ": Always saturated as indicated by w=1 for the full range (x",
          "1",
          ", x",
          "2",
          "). This occurs when Ra/Tsin",
          "q",
          "is greater than 1. This is represented (coded) with a value of 3.",
          "Threshold Saturation",
          ": Cells having a probability of being saturated are represented (coded) with a value of 2.",
          "Partially Wet and Low Moisture",
          ": Cells that are never saturated. The level of saturation is encoded as ((R/T)_max)(a/sin",
          "q)",
          ", a number between 0 and 1 which represents the wettest the cell could get given the range of R/T specified. "
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Intermediate_Output_Files_Location",
        "description": [
          "A folder where intermediate results are written."
        ],
        "dataType": "Workspace",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Delete_Intermediate_Output_Files_Upon_Completion",
        "description": [
          "Check this to delete intermediate files upon completion (but leave the folder)."
        ],
        "dataType": "Boolean",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Minimum_Terrain_Recharge__m_hr_",
        "description": [
          "Lower bound of steady state recharge used to compute soil profile saturation (m/hr)."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Maximum_Terrain_Recharge__m_hr_",
        "description": [
          "Upper bound of steady state recharge used to compute soil profile saturation (m/hr)."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/CreateParameterRegionGrid.html",
    "name": "Create Parameter Region Grid",
    "description": [
      "The SINMAP stability index tool requires  parameters to be input using a grid that is the same dimensions as the digital  elevation model (DEM) with integer values that reference into rows of a  parameter table. This tool generates both the grid and the parameter  table.",
      "There are options to (1) create a single  region that has the same parameters for the whole domain, (2) create regions  based on an input grid and (3) create regions based on an input feature class.  In the latter two cases the inputs are resampled to the scale of the  DEM."
    ],
    "usage": "Command line syntax: SIRegionTool.py --dem <demfile>  --parreg <output parameter region tif file> --att <output attribute  table> [--parreg-in <input region  raster>] [ --shp <input  feature class> --shp-att-name <input feature  attribute>]",
    "syntax": "ParameterRegionTool (Input_DEM_Dataset,  Select_Region_Creation_Option, {Input_Region_Raster},  {Input_Region_Feature_Class},  {Select_Feature_Class_Attribute____FID__is_not_a_valid_attribute_},  Output_Parameter_Region_Grid___tif_format_,  Output_Parameter_Table_Text_File__must_be__txt_or__csv_or__dat_) ",
    "parameters": [
      {
        "parameterName": "Input_DEM_Dataset",
        "description": [
          "Digital elevation Model grid used to set the dimensions (cell size, rows and columns and spatial reference) of the region grid."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Region_Raster (Optional)",
        "description": [
          "An integer raster defining parameter regions.  The values will be resampled to the DEM scale to populate the integer valued parameter region grid."
        ],
        "dataType": "Raster Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Region_Feature_Class (Optional)",
        "description": [
          "A polygon feature class defining parameter regions. "
        ],
        "dataType": "Table View",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Parameter_Region_Grid",
        "description": [
          "An integer valued tif file defining parameter regions resampled to have dimensions exactly the same as the input raster."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Parameter_Table_Text_File",
        "description": [
          "__must_be__txt_or__csv_or__dat_. ",
          "A comma separated attribute table with one row of parameters for each value in the parameter region grid. ",
          "Example format:",
          "SiID,tmin,tmax,cmin,cmax,phimin,phimax,SoilDens",
          "1,2.708,2.708,0.0,0.25,30.0,45.0,2000.0",
          "2,2.208,2.508,1.0,0.25,30.0,45.0,2000.0",
          "Columns are",
          "SiID - Identifier",
          "tmin - Transmissivity lower bound (m^2/hr)",
          "tmax - Transmissivity upper bound (m^2/hr)",
          "cmin - Dimensionless cohesion lower bound",
          "cmax - Dimensionless cohesion upper bound",
          "phimin - Soil friction angle lower bound",
          "phimax - Soil friction angle upper bound",
          "SoilDens - Soil density (kg/m^3)"
        ],
        "dataType": "File",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Select_Region_Creation_Option",
        "description": [
          "Input source for parameter regions.  (1) One uniform parameter region will set the same parameters for the entire domain defined by the input DEM.  (2) Regions from raster requires an integer raster to be input and will generate a parameter table with separate row of parameters for each value in the designated raster.  This table may then be edited to set different parameters for each region. (3) Regions from polygon features will generate an integer raster with grid values from the designated field in the polygon feature table and a parameter table with separate row of parameters for each value in the raster."
        ],
        "dataType": "String",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Select_Feature_Class_Attribute (Optional)",
        "description": [
          "_FID_is_not_a_valid_attribute_ ",
          "The field in the feature class used to set parameter regions. You should not select FID or the shape field. The field selected will be used to populate the integer valued parameter region grid."
        ],
        "dataType": "Field",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/PitRemove.html",
    "name": "Pit Remove",
    "description": [
      "This funciton identifies all pits in the DEM and raises their elevation to the level  of the lowest pour point around their edge. Pits, also referred to as depressions or sinks, are low elevation areas in  digital elevation models (DEMs) that are completely surrounded by higher  terrain. They are generally taken to be artifacts that interfere with the  routing of flow across DEMs, so are removed by raising their elevationt, or filling them, to the point where they drain off the edge of the domain. The pour point is the lowest  point on the boundary of the \"watershed\" draining to the pit. ",
      "This pit removal step is not    essential if you have reason to believe that all the pits in your DEM are real. This    step can be circumvented by using the raw DEM as input to other TauDEM functions in the place where a filled DEM is used, such as by copying the raw DEM source data onto the file with    suffix \"fel\" to simulate the output of \"Pit Remove\" without actually removing    the pits. "
    ],
    "usage": "mpiexec -n <number of processes>  PitRemove    - z  <demfile>  -fel   <  felfile > [   -4way  ] [  -depmask  depmaskfile] demfile: Input elevation grid depmaskfile: depression mask file(Optional) felfile: Output elevation grid with pits  filled",
    "syntax": "PitRemove (Input_Elevation_Grid,  {Fill_Considering_only_4_way_neighbors}, {Input_Depression_Mask_Grid},  Input_Number_of_Processes, Output_Pit_Removed_Elevation_Grid) ",
    "parameters": [
      {
        "parameterName": "Input_Elevation_Grid",
        "description": [
          "A digital elevation model (DEM) grid to serve as the base input for the terrain analysis and stream delineation.",
          "Pits are generally assumed to be artifacts of the digitation process that interfere with the processing of flow across DEMs, and so are removed by raising their elevation to the point where they just drain. However, if there are specific pits that ou do not wish to remove they can be marked using the separate depression mask input grid, or have  \"no data\" elevation values inserted at their lowest point. \"No data\" values serve to define edges in the flow field, and elevations are only raised to where flow is off an edge, so an internal \"no data\" value will stop a pit from being removed."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Depression_Mask_Grid (Optional)",
        "description": [
          "Depression mask indicator grid (depmask) to identify cells that are real pits (or sinks or depressions) and should not be filled"
        ],
        "dataType": "Raster Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Pit_Removed_Elevation_Grid",
        "description": [
          "A grid of elevation values with pits removed so that flow is routed off of the domain. Pits are low elevation areas in digital elevation models (DEMs) that are completely surrounded by higher terrain. They are generally taken to be artifacts of the digitation process that interfere with the processing of flow across DEMs. So, they are removed by raising their elevation to the point where they just drain."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Fill_Considering_only_4_way_neighbors (Optional)",
        "description": [
          "If this option is selected Fill ensures that the grid is hydrologically conditioned with cell to cell connectivity in only 4 directions (N, S, E or W neighbors). Each grid cell is conditioned to drain to one of these adjacent, but not diagonal neighbors."
        ],
        "dataType": "Boolean",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "The number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each of the stripes."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/D8FlowDirections.html",
    "name": "D8 Flow Directions",
    "description": [
      "Creates 2 grids. The first contains the flow direction from each grid  cell to one of its adjacent or diagonal neighbors, calculated using the  direction of steepest descent. The second contain the slope, as evaluated in the  direction of steepest descent, and is reported as drop/distance, i.e. tan of the  angle. Flow direction is reported as \"no data\" for any grid cell adjacent to the  edge of the DEM domain, or adjacent to a \"no data\" value in the DEM. In flat  areas, flow directions are assigned away from higher ground and towards lower  ground using the method of Garbrecht and Martz (1997). The D8 flow direction  algorithm may be applied to a DEM that has not had its pits filled, but it will  then result in \"no data\" values for flow direction and slope at the lowest point  of each pit."
    ],
    "usage": "mpiexec -n <number of processes>  D8FlowDir   -fel  < felfile  >  -p  <  pfile >  - sd8  <  sd8file >   felfile: Pit filled elevation input data pfile: D8 flow directions output  sd8file: D8 slopes output",
    "syntax": "D8FlowDir (Input_Pit_Filled_Elevation_Grid,  Input_Number_of_Processes, Output_D8_Flow_Direction_Grid, Output_D8_Slope_Grid)  ",
    "parameters": [
      {
        "parameterName": "Input_Pit_Filled_Elevation_Grid",
        "description": [
          "A grid of elevation values. This is usually the output of the \"Pit Remove\" tool, in which case it is elevations with pits removed. Pits are low elevation areas in digital elevation models (DEMs) that are completely surrounded by higher terrain. They are generally taken to be artifacts of the digitation process that interfere with the processing of flow across DEMs. So they are removed by raising their elevation to the point where they just drain off the domain. This step is not essential if you have reason to believe that the pits in your DEM are real. This step can be circumvented by copying the raw DEM source data onto the file with suffix \"fel\" to simulate the output of \"Pit Remove\" without actually removing the pits. Also, if a few pits actually exist and so should not be removed, while at the same time others are believed to be artifacts that need to be removed, the actual pits should have \"no data\" elevation values inserted at their lowest point. \"No data\" values serve to define edges of the domain in the flow field, and elevations are only raised to where flow is off an edge, so an internal \"no data\" value will stop a pit from being removed, if necessary."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_D8_Flow_Direction_Grid",
        "description": [
          "A grid of D8 flow directions which are defined, for each cell, as the direction of the one of its eight adjacent or diagonal neighbors with the steepest downward slope."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_D8_Slope_Grid",
        "description": [
          "A grid giving slope in the D8 flow direction. This is measured as drop/distance."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "The number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each of the stripes."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/D8ContributingArea.html",
    "name": "D8 Contributing Area",
    "description": [],
    "usage": "mpiexec -n <number of processes>  AreaD8   -p  < pfile >   -ad8  < ad8file > [   -o  <outletfile>] [   -wg  < wgfile >] [   -nc  ] [  -lyrname   < layer name >] [  -lyrno  < layer number  >] pfile: Input flow directions grid ad8file: Output contributing area grid outletfile: input outlets file (OGR readable dataset,  optional) wgfile: Input weight grid (optional) nc: Flag for edge contamination layer name: OGR layer name if outlets are not the first layer in  outletfile (optional) layer number: OGR layer number if outlets are not the first layer  in outletfile (optional) Layer name and layer number should not both be  specified.",
    "syntax": "D8ContributingArea (Input_D8_Flow_Direction_Grid,  {Input_Outlets}, {Input_Weight_Grid}, Check_for_edge_contamination,  Input_Number_of_Processes, Output_D8_Contributing_Area_Grid) ",
    "parameters": [
      {
        "parameterName": "Input_D8_Flow_Direction_Grid",
        "description": [
          "A grid of D8 flow directions which are defined, for each cell, as the direction of the one of its eight adjacent or diagonal neighbors with the steepest downward slope."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Outlets (Optional)",
        "description": [
          "A point feature defining the outlets of interest. If this input is used, only the cells upslope of these outlet points are considered to be within the domain being evaluated."
        ],
        "dataType": "Feature Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Weight_Grid (Optional)",
        "description": [
          "A grid giving contribution to flow for each cell. These contributions (also sometimes referred to as weights or loadings) are used in the contributing area accumulation. If this input file is not used, the contribution to flow will assumed to be one for each grid cell."
        ],
        "dataType": "Raster Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_D8_Contributing_Area_Grid",
        "description": [
          "A grid of contributing area values calculated as the cells own contribution plus the contribution from upslope neighbors that drain in to it according to the D8 flow model."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Check_for_edge_contamination",
        "description": [
          "A flag that indicates whether the tool should check for edge contamination. Edge contamination is defined as the possibility that a contributing area value may be underestimated due to the fact that grid cells outside of the domain have not been evaluated. This occurs when drainage is inwards from the boundaries or areas with \"no data\" values for elevation. The algorithm recognizes this and reports \"no data\" for the impated cells. It is common to see streaks of \"no data\" values extending inwards from boundaries along flow paths that enter the domain at a boundary. This is the desired effect and indicates that contributing area for these grid cells is unknown due to it being dependent on terrain outside of the domain of available data. Edge contamination checking may be turned off in cases where you know this is not an issue, or want to ignore these problems, if for example, the DEM has been clipped along a watershed outline."
        ],
        "dataType": "Boolean",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "The number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each of the stripes."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/TopographicWetnessIndex.html",
    "name": "Topographic Wetness Index",
    "description": [
      "Calculates the ratio of the natural log of the specific catchment area  (contributing area) to slope, ln(a/S), or ln(a/tan (beta)). This provides an  indication of depth to water table. No data values occur in locations where  slope is 0 (flat)."
    ],
    "usage": "mpiexec -n <number of processes> TWI   -slp  < slpfile>  -sca  <scafile >  -twi  < twifile   > slpfile: input slope file scafile: input specific catchment area file twifile: output topographic wetness index file",
    "syntax": "TopographicWetnessIndex  (Input_Specific_Catchment_Area_Grid, Input_Slope_Grid,  Input_Number_of_Processes, Output_Wetness_Index_Grid) ",
    "parameters": [
      {
        "parameterName": "Input_Specific_Catchment_Area_Grid",
        "description": [
          "A grid of specific catchment area which is the contributing area per unit contour length.  This should have units of length (area per contour width).  It may be the output of the multiple flow direction D-Infinity contributing area function in which case the function by default (without an input weight grid) scales the contributing area in number of cells by the cell size to produce specific catchment area.",
          "If D8 or some other contributing area evaluated using the number of cells is used here it should first be scaled by cell size to give specific catchment area in length units."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Slope_Grid",
        "description": [
          "A grid of slope. This grid can be generated using ether the \"D8 Flow Directions\" tool or the \"D-Infinity Flow Directions\" tool."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Wetness_Index_Grid",
        "description": [
          "A grid of the natural log of the ratio of specific catchment area (contributing area) to slope, ln(a/S)."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "The number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each of the stripes."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/SlopeOverAreaRatio.html",
    "name": "Slope Over Area Ratio",
    "description": [
      "Calculates the ratio of the slope to the specific catchment area  (contributing area). This is algebraically related to the more common ln(a/tan  beta) wetness index, but contributing area is in the denominator to avoid divide  by 0 errors when slope is 0."
    ],
    "usage": "mpiexec -n <number of processes>  SlopeAreaRatio   -slp  <slpfile>   -sca  <scafile>   -sar  < sarfile > slpfile: input slope file scafile: input specific catchment area file sarfile: output slope area ratio file",
    "syntax": "SlopeOverAreaRatio (Input_Slope_Grid,  Input_Specific_Catchment_Area_Grid, Input_Number_of_Processes,  Output_Slope_Divided_By_Area_Ratio_Grid) ",
    "parameters": [
      {
        "parameterName": "Input_Slope_Grid",
        "description": [
          "A grid of slope. This grid can be generated using ether the \"D8 Flow Directions\" tool or the \"D-Infinity Flow Directions\" tool."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Specific_Catchment_Area_Grid",
        "description": [
          "A grid giving the contributing area value for each cell taken as its own contribution plus the contribution from upslope neighbors that drain in to it. Contributing area is counted in terms of the number of grid cells (or summation of weights). This grid can be generated using either the \"D8 Contributing Area\" tool or the \"D-Infinity Contributing Area\" tool."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Slope_Divided_By_Area_Ratio_Grid",
        "description": [
          "A grid of the ratio of slope to specific catchment area (contributing area). This is algebraically related to the more common ln(a/tan beta) wetness index, but contributing area is in the denominator to avoid divide by 0 errors when slope is 0."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "The number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each of the stripes."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/SlopeAverageDown.html",
    "name": "Slope Average Down",
    "description": [
      "This tool computes slope in a D8 downslope direction averaged over a  user selected distance. Distance should be specified in horizontal map  units."
    ],
    "usage": "mpiexec -n <number of processes>  SlopeAveDown   -fel  <felfile>   -p  <pfile>   -slpd  < slpdfile >  [ -dn ] felfile: Input pit filled elevation grid pfile: Input D8 flow direction grid slpdfile: Output D8 slope distance averaged grid dn: User selected downslope distance",
    "syntax": "SlopeAverageDown (Input_D8_Flow_Direction_Grid,  Input_Pit_Filled_Elevation_Grid, Distance, Input_Number_of_Processes,  Output_Slope_Average_Down_Grid) ",
    "parameters": [
      {
        "parameterName": "Input_D8_Flow_Direction_Grid",
        "description": [
          "This input is a grid of flow directions that are encoded using the D8 method where all flow from a cells goes to a single neighboring cell in the direction of steepest descent."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Pit_Filled_Elevation_Grid",
        "description": [
          "A grid of elevation values. This is usually the output of the \"Pit Remove\" tool, in which case it is elevations with pits removed. Pits are low elevation areas in digital elevation models (DEMs) that are completely surrounded by higher terrain. They are generally taken to be artifacts that interfere with the processing of flow across DEMs, so are removed by raising their elevation to the point where they just drain. This step is not essential if you have reason to believe that the pits in your DEM are real."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Slope_Average_Down_Grid",
        "description": [
          "A grid of the ratio of  specific catchment area (contributing area) to slope."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Distance",
        "description": [
          "Input parameter of downslope distance over which to calculate the slope (in horizontal map units)."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "This input indicates the number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each piece of the domain."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/D8DistanceToStreams.html",
    "name": "D8 Distance To Streams",
    "description": [
      "Computes the horizontal distance to stream for each grid cell, moving  downslope according to the D8 flow model, until a stream grid cell is  encountered."
    ],
    "usage": "mpiexec -n <number of processes>  D8HDistTostrm     -p  <pfile>   -src  <srcfile>   -dist  < distfile > [   -thresh ] pfile: D8 flow direction input file srcfile: stream channel definition input file distfile: distance to stream channel output file thresh: integer value used to define channels in srcfile ",
    "syntax": "D8DistanceToStreams  (Input_D8_Flow_Direction_Grid, Input_Stream_Raster_Grid, Threshold,  Input_Number_of_Processes, Output_Distance_to_Streams_Grid) ",
    "parameters": [
      {
        "parameterName": "Input_D8_Flow_Direction_Grid",
        "description": [
          "This input is a grid of flow directions that are encoded using the D8 method where all flow from a cells goes to a single neighboring cell in the direction of steepest descent."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Stream_Raster_Grid",
        "description": [
          "A grid indicating streams. Such a grid can be created by several of the tools in the \"Stream Network Analysis\" toolset. However, the tools in the \"Stream Network Raster\" toolset only create grids with a value of 0 for no stream, or 1 for stream cells. This tool can also accept grids with values greater than 1, which can be used in conjunction with the Threshold parameter to determine the location of streams. This allows Contributing Area grids to be used to define streams as well as the normal Stream Raster grids. This grid expects integer (long integer) values and any non-integer values will be truncated to an integer before being evaluated."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Distance_to_Streams_Grid",
        "description": [
          "A grid giving the horizontal distance along the flow path as defined by the D8 Flow Directions Grid to the streams in the Stream Raster Grid."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Threshold",
        "description": [
          "This value acts as threshold on the Stream Raster Grid to determine the location of streams. Cells with a Stream Raster Grid value greater than or equal to the Threshold value are interpreted as streams. If not specified the Threshold to define streams defaults to 1."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "This input indicates the number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each piece of the domain."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/GridNetwork.html",
    "name": "Grid Network",
    "description": [
      "Creates 3 grids that contain for each grid cell: 1) the longest  path, 2) the total path, and 3) the Strahler order number. These values are  derived from the network defined by the D8 flow model.",
      "The longest upslope length is the length of the flow path from  the furthest cell that drains to each cell. The total upslope path length is the  length of the entire grid network upslope of each grid cell. Lengths are  measured between cell centers taking into account cell size and whether the  direction is adjacent or diagonal.",
      "Strahler order is defined as follows: A network of flow paths is  defined by the D8 Flow Direction grid. Source flow paths have a Strahler order  number of one. When two flow paths of different order join the order of the  downstream flow path is the order of the highest incoming flow path. When two  flow paths of equal order join the downstream flow path order is increased by 1.  When more than two flow paths join the downstream flow path order is calculated  as the maximum of the highest incoming flow path order or the second highest  incoming flow path order + 1. This generalizes the common definition to cases  where more than two flow paths join at a point.",
      "Where the optional mask grid and threshold value are input, the  function is evaluated only considering grid cells that lie in the domain with  mask grid value greater than or equal to the threshold value. Source (first  order) grid cells are taken as those that do not have any other grid cells from  inside the domain draining in to them, and only when two of these flow paths  join is order propagated according to the ordering rules. Lengths are also only  evaluated counting paths within the domain greater than or equal to the  threshold.",
      "If the optional outlet point is used, only the outlet cells and the  cells upslope (by the D8 flow model) of them are in the domain to be  evaluated."
    ],
    "usage": "mpiexec -n <number of processes>  Gridnet    -p <pfile>  -plen   < plenfile >   -tlen  < tlenfile >   -gord  < gordfile > [ -o  <outletfile>] [ -lyrname  <layer  name>] [ -lyrno   <layer number>] [ -mask  <maskfile> [ -thresh  <threshold>]]   tlenfile: grid of total path length upstream of each point output  file gordfile: grid of strahler order output file outletfile: input outlets file (OGR readable dataset) layer name: OGR layer name if outlets are not the first layer in outletfile (optional) layer number: OGR layer number if outlets are not the first layer  in outletfile (optional) Layer name and layer number should not both be  specified. maskfile: mask file(optional) threshold: Where a maskfile is input, there is an additional option to specify a threshold.  This has to be immediately following the maskfile on the argument list.  The grid network is evaluated for grid cells where values of the maskfile grid read as 4 byte integers are >= threshold.",
    "syntax": null,
    "parameters": [
      {
        "parameterName": "Input_D8_Flow_Direction_Grid",
        "description": [
          "A grid of D8 flow directions which are defined, for each cell, as the direction of the one of its eight adjacent or diagonal neighbors with the steepest downward slope."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Outlets (Optional)",
        "description": [
          "A point feature  defining the outlets of interest. If this input feature is used, only the cells upslope of these outlet cells are considered to be within the domain being evaluated."
        ],
        "dataType": "Feature Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Mask_Grid (Optional)",
        "description": [
          "A grid that is used to determine the domain do be analyzed. If the mask grid value >= mask threshold, then the cell will be included in the domain. While this tool does not have an edge contamination flag, if edge contamination analysis is needed, then a mask grid from a function like AreaD8 that does support edge contamination can be used to achieve the same result."
        ],
        "dataType": "Raster Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Mask_Threshold_Value (Optional)",
        "description": [
          "This input parameter is used in the calculation mask grid value >= mask threshold to determine if the grid cell is in the domain to be analyzed."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Strahler_Network_Order_Grid",
        "description": [
          "A grid giving the Strahler order number for each cell. A network of flow paths is defined by the D8 Flow Direction grid. Source flow paths have a Strahler order number of one. When two flow paths of different order join the order of the downstream flow path is the order of the highest incoming flow path. When two flow paths of equal order join the downstream flow path order is increased by 1. When more than two flow paths join the downstream flow path order is calculated as the maximum of the highest incoming flow path order or the second highest incoming flow path order + 1. This generalizes the common definition to cases where more than two flow paths join at a point."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Longest_Upslope_Length_Grid",
        "description": [
          "A grid that gives the length of the longest upslope D8 flow path terminating at each grid cell. Lengths are measured between cell centers taking into account cell size and whether the direction is adjacent or diagonal."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Total_Upslope_Length_Grid",
        "description": [
          "The total upslope path length is the length of the entire D8 flow grid network upslope of each grid cell. Lengths are measured between cell centers taking into account cell size and whether the direction is adjacent or diagonal."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "The number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each of the stripes."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/DInfinityUpslopeDependence.html",
    "name": "D-Infinity Upslope Dependence",
    "description": [
      "The D-Infinity Upslope Dependence tool quantifies the amount each grid  cell in the domain contributes to a destination set of grid cells. D-Infinity  flow directions proportion flow from each grid cell between multiple downslope  grid cells. Following this flow field downslope the amount of flow originating  at each grid cell that reaches the destination zone is defined. Upslope  influence is evaluated using a downslope recursion, examining grid cells  downslope from each grid cell, so that the map produced identifies the area  upslope where flow through the destination zone originates, or the area it  depends on, for its flow."
    ],
    "usage": "mpiexec -n <number of processes>  DinfUpDependence   -ang  <angfile>  -dg  <dgfile>  -dep   < depfile >   angfile: Dinf flow direction input file dgfile: disturbance grid input file depfile: flow dependence output file",
    "syntax": "DInfUpslopeDependence  (Input_D-Infinity_Flow_Direction_Grid, Input_Destination_Grid,  Input_Number_of_Processes, Output_Upslope_Dependence_Grid) ",
    "parameters": [
      {
        "parameterName": "Input_D-Infinity_Flow_Direction_Grid",
        "description": [
          "A grid giving flow direction by the D-Infinity method where the flow direction angle is determined as the direction of the steepest downward slope on the eight triangular facets formed in a 3 x 3 grid cell window centered on the grid cell of interest. Flow direction is measured in radians, counter-clockwise from east as a continuous (floating point) quantity between 0 and 2 pi. The algorithm is described in Tarboton, D. G., (1997), \"A New Method for the Determination of Flow Directions and Contributing Areas in Grid Digital Elevation Models,\" Water Resources Research, 33(2): 309-319. This grid can be produced using the D-Infinity Flow Direction tool."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Destination_Grid",
        "description": [
          "A grid that encodes the destination zone that may receive flow from upslope. This grid must be 1 inside the zone y and 0 over the rest of the domain."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Upslope_Dependence_Grid",
        "description": [
          "A grid quantifing the amount each source point in the domain contributes to the zone defined by the destination grid."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "This input indicates the number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each piece of the domain."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/DInfinityReverseAccumulation.html",
    "name": "D-Infinity Reverse Accumulation",
    "description": [
      "This works in a similar way to evaluation of weighted Contributing  area, except that the accumulation is by propagating the weight loadings upslope  along the reverse of the flow directions to accumulate the quantity of weight  loading downslope from each grid cell. The function also reports the maximum  value of the weight loading downslope from each grid cell in the Maximum  Downslope grid."
    ],
    "usage": "mpiexec -n <number of processes>  DinfRevAccum   -ang   < angfile >  -wg   <wgfile>  -racc   < raccfile >   -dmax < dmaxfile >   angfile: Input Dinf flow direction grid wgfile: Input weight grid raccfile: Output reverse accumulation grid dmaxfile: Output maximum downslope grid",
    "syntax": "DInfReverseAccumulation  (Input_D-Infinity_Flow_Direction_Grid, Input_Weight_Grid,  Input_Number_of_Processes, Output_Reverse_Accumulation_Grid,  Output_Maximum_Downslope_Grid) ",
    "parameters": [
      {
        "parameterName": "Input_D-Infinity_Flow_Direction_Grid",
        "description": [
          "A grid giving flow direction by the Dinfinity method. Flow direction is measured in radians, counter clockwise from east. This is created by the function \"Dinf flow directions\". The algorithm is described in Tarboton, D. G., (1997), \"A New Method for the Determination of Flow Directions and Contributing Areas in Grid Digital Elevation Models,\" Water Resources Research, 33(2): 309-319."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Weight_Grid",
        "description": [
          "A grid giving weights (loadings) to be used in the accumulation."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Reverse_Accumulation_Grid",
        "description": [
          "The grid giving the result of the \"Reverse Accumulation\" function. This works in a similar way to evaluation of weighted Contributing area, except that the accumulation is by propagating the weight loadings upslope along the reverse of the flow directions to accumulate the quantity of loading downslope from each grid cell."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Maximum_Downslope_Grid",
        "description": [
          "The grid giving the maximum of the weight loading grid downslope from each grid cell."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "This input indicates the number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each piece of the domain."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/DInfinityTransportLimitedAccumulation.html",
    "name": "D-Infinity Transport Limited Accumulation",
    "description": [
      "This function is designed to calculate the transport and deposition of  a substance (e.g. sediment) that may be limited by both supply and the capacity  of the flow field to transport it. This function accumulates substance flux  (e.g. sediment transport) subject to the rule that transport out of any grid  cell is the minimum between supply and transport capacity, Tcap. The total  supply at a grid cell is calculated as the sum of the transport in from upslope  grid cells, Tin, plus the local supply contribution, E (e.g. erosion). This  function also outputs deposition, D, calculated as total supply minus actual  transport."
    ],
    "usage": "mpiexec -n <number of processes >  DinfTransLimAccum   -ang   <angfile>  -tsup   <tsupfile>  -tc   <tcfile> [  -cs   <csfile>  -ctpt   < ctptfile > ]   -tla  < tlafile >   -tdep  < tdepfile > [   -o  <outletfile>] [   -nc ] [ -lyrname   <layer name>] [  -lyrno  <layer number>] angfile: Dinf flow direction input grid tsupfile: Input transport supply grid tcfile:Input transport capacity grid csfile:Input concentration grid (optional) ctptfile:Output concentration grid (optional) tlafile:Output transport limited accumulation grid  tdepfile:Output deposition grid outletfile: input outlets file (OGR readable dataset) nc: Flag for edge contamination layer name: OGR layer name if outlets are not the first layer in  outletfile (optional) layer number: OGR layer number if outlets are not the first layer  in outletfile (optional) Layer name and layer number should not both be  specified.",
    "syntax": "DInfTransportLimited  (Input_D-Infinity_Flow_Direction_Grid, Input_Supply_Grid,  Input_Transport_Capacity_Grid, {Input_Concentration_Grid}, {Input_Outlets},  Check_for_Edge_Contamination, Input_Number_of_Processes,  Output_Transport_Limited_Accumulation_Grid, Output_Deposition_Grid,  {Output_Concentration_Grid}) ",
    "parameters": [
      {
        "parameterName": "Input_D-Infinity_Flow_Direction_Grid",
        "description": [
          "A grid giving flow direction by the D-infinity method. Flow direction is measured in radians, counter clockwise from east. This can be created by the tool D-Infinity Flow Directions . The algorithm is described in Tarboton, D. G., (1997), \"A New Method for the Determination of Flow Directions and Contributing Areas in Grid Digital Elevation Models,\" Water Resources Research, 33(2): 309-319."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Supply_Grid",
        "description": [
          "A grid giving the supply (loading) of material to a transport limited accumulation function. In the application to erosion, this grid would give the erosion detachment, or sediment supplied at each grid cell."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Transport_Capacity_Grid",
        "description": [
          "A grid giving the transport capacity at each grid cell for the transport limited accumulation function. In the application to erosion this grid would give the transport capacity of the carrying flow."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Concentration_Grid (Optional)",
        "description": [
          "A grid giving the concentration of a compound of interest in the supply to the transport limited accumulation function. In the application to erosion, this grid would give the concentration of say phosphorous adhered to the eroded sediment."
        ],
        "dataType": "Raster Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Outlets (Optional)",
        "description": [
          "This optional input is a point feature  defining outlets of interest. If this input  is used, the tool will only evaluate the area upslope of these outlets."
        ],
        "dataType": "Feature Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Transport_Limited_Accumulation_Grid",
        "description": [
          "This grid is the weighted accumulation of supply accumulated respecting the limitations in transport capacity and reports the transport rate calculated by accumulating the substance flux subject to the rule that the transport out of any grid cell is the minimum of the total supply (local supply plus transport in) to that grid cell and the transport capacity."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Deposition_Grid",
        "description": [
          "A grid giving the deposition resulting from the transport limited accumulation. This is the residual from the transport in to each grid cell minus the transport capacity out of the grid cell. The deposition grid is calculated as the transport in + the local supply - the tranport out."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Concentration_Grid (Optional)",
        "description": [
          "If an input concentation in supply grid is given, then this grid is also output and gives the concentration of a compound (contaminant) adhered or bound to the transported substance (e.g. sediment) is calculated."
        ],
        "dataType": "Raster Dataset",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Check_for_Edge_Contamination",
        "description": [
          "This checkbox determines whether the tool should check for edge contamination. Edge contamination is defined as the possibility that a value may be underestimated due to grid cells outside of the domain not being considered when determining the result. This occurs when drainage is inwards from the boundaries or areas with no data values for elevation. The algorithm recognizes this possibility and reports no data for the result. It is common to see streaks of no data values extending inwards from boundaries along flow paths that enter the domain at a boundary. This is the desired effect, and indicates that values for these grid cells is unknown due to it being dependent on terrain outside of the available data. Edge contamination checking may be overridden in cases where you know it is not an issue, or want to ignore the problems, if for example, the DEM has been clipped along a watershed outline."
        ],
        "dataType": "Boolean",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "This input indicates the number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each piece of the domain."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/DInfinityDistanceUp.html",
    "name": "D-Infinity Distance Up",
    "description": [
      "This tool calculates the distance from each grid cell up to the ridge  cells along the reverse D-infinity flow directions. Ridge cells are defined to  be grid cells that have no contribution from grid cells further upslope. Given  the convergence of multiple flow paths at any grid cell, any given grid cell can  have multiple upslope ridge cells. There are three statictical methods that this  tool can use: maximum distance, minimum distance and weighted flow average over  these flow paths. A variant on the above is to consider only grid cells that  contribute flow with a proportion greater than a user specified threshold (t) to  be considered as upslope of any given grid cell. Setting t=0.5 would result in  only one flow path from any grid cell and would give the result equivalent to a  D8 flow model, rather than D-infinity flow model, where flow is proportioned  between two downslope grid cells. There are several different options for the way distance can be measured: the total straight line path (Pythagoras), the  horizontal component of the straight line path, the vertical component of the  straight line path, or the total surface flow path."
    ],
    "usage": "mpiexec -n <number of processes>  DinfDistUp   -ang  <angfile>  -fel  <felfile>  -slp   <slpfile>  -du   < dufile >  [ -m  <method> ] [   -thresh  ] [  -nc ] angfile: Input Dinf flow direction grid felfile: Input pit filled elevation grid slpfile: Input slope grid dufile: Output Dinf rise to ridge grid method: Method to be used (Encoding is h = horizontal, v = vertical, p  = Pythagoras, s = surface, ave = average, min = minimum, and max = maximum) thresh: Used to consider only grid cells that contribute flow with a  proportion greater than a user specified threshold.",
    "syntax": "DInfDistanceUp  (Input_D-Infinity_Flow_Direction_Grid, Input_Pit_Filled_Elevation_Grid,  Input_Slope_Grid, Input_Proportion_Threshold, Statistical_Method,  Distance_Method, Check_for_Edge_Contamination, Input_Number_of_Processes,  Output_D-Infinity_Distance_Up_Grid) ",
    "parameters": [
      {
        "parameterName": "Input_D-Infinity_Flow_Direction_Grid",
        "description": [
          "A grid giving flow directions by the D-Infinity method. This is usually the output of the D-Infinity Flow Directions tool. Flow direction is measured in radians, counter clockwise from east. The algorithm is described in Tarboton, D. G., (1997), \"A New Method for the Determination of Flow Directions and Contributing Areas in Grid Digital Elevation Models,\" Water Resources Research, 33(2): 309-319"
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Pit_Filled_Elevation_Grid",
        "description": [
          "This input is a grid of elevation values. As a general rule, it is recommended that you use a grid of elevation values that have had the pits removed for this input. Pits are generally taken to be artifacts that interfere with the analysis of flow across them. This grid can be obtained as the output of the \"Pit Remove\" tool, in which case it contains elevation values where the pits have been filled to the point where they just drain."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Slope_Grid",
        "description": [
          "This input is a grid of slope values. This is measured as drop/distance and it is most often obtained as the output of the \"D-Infinity Flow Directions\" tool."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Proportion_Threshold",
        "description": [
          "The proportion threshold parameter where only grid cells that contribute flow with a proportion greater than this user specified threshold (t) is considered to be upslope of any given grid cell. Setting t=0.5 would result in only one flow path from any grid cell and would give the result equivalent to a D8 flow model, rather than D-infinity flow model, where flow is proportioned between two downslope grid cells."
        ],
        "dataType": "Double",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_D-Infinity_Distance_Up_Grid",
        "description": [
          "Creates a grid containing the distances up to the ridge calculated using the D-infinity flow model and the statistical and path methods chosen"
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Statistical_Method",
        "description": [
          "Statistical method used to calculate the distance down to the stream. In the D-infinity flow model, the outflow from each grid cell is proportioned between two downslope grid cells. Therefore, the distance from any grid cell to a stream is not uniquely defined. Flow that originates at a particular grid cell may enter the stream at a number of cells. The distance to the stream may be defined as the longest, shortest or weighted average of the distance down to the stream."
        ],
        "dataType": "String",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Distance_Method",
        "description": [
          "Distance method used to calculate the distance down to the stream. One of several aspects of measuring distance may be selected: the total straight line path (Pythagoras), the horizontal component of the straight line path, the vertical component of the straight line path, or the total surface flow path."
        ],
        "dataType": "String",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Check_for_Edge_Contamination",
        "description": [
          "A flag that determines whether the tool should check for edge contamination. This is defined as the possibility that a value may be underestimated due to grid cells outside of the domain not being counted. This occurs when drainage is inwards from the boundaries or areas with no data values for elevation. The algorithm recognizes this and reports no data for the value. It is common to see streaks of no data values extending inwards from boundaries along flow paths that enter the domain at a boundary. This is the desired effect and indicates that values for these grid cells is unknown due to it being dependent on terrain outside of the domain of data available. Edge contamination checking may be overridden in cases where you know this is not an issue or want to ignore these problems, if for example the DEM has been clipped along a watershed outline."
        ],
        "dataType": "Boolean",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "This input indicates the number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each piece of the domain."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/DInfinityDistanceDown.html",
    "name": "D-Infinity Distance Down",
    "description": [
      "Calculates the distance downslope to a stream using the D-infinity flow  model. The D-infinity flow model is a multiple flow direction model, because the  outflow from each grid cell is proportioned between up to 2 downslope grid  cells. As such, the distance from any grid cell to a stream is not uniquely  defined. Flow that originates at a particular grid cell may enter the stream at  a number of different cells. The statistical method may be selected as the  longest, shortest or weighted average of the flow path distance to the stream.  Also one of several ways of measuring distance may be selected: the total  straight line path (Pythagoras), the horizontal component of the straight line  path, the vertical component of the straight line path, or the total surface  flow path."
    ],
    "usage": "mpiexec -n <number of processes>  DinfDistDown   -ang  <angfile>  -fel  <felfile>  -src   <srcfile> [  -wg   <weightfile>]  -dd   < ddfile > [   -m  ave h] [  -nc ] angfile: Input Dinf flow direction grid felfile: Input pit filled elevation grid srcfile: Input stream raster grid wgfile: Input weight path grid ddfile: Output distance down grid method: Method to be used (Encoding is h = horizontal, v =  vertical, p = Pythagoras, s = surface, ave = average, min = minimum, and max = maximum) nc: Flag for edge contamination",
    "syntax": "DInfDistanceDown  (Input_D-Infinity_Flow_Direction_Grid, Input_Pit_Filled_Elevation_Grid,  Input_Stream_Raster_Grid, Statistical_Method, Distance_Method,  Check_for_edge_contamination, {Input_Weight_Path_Grid},  Input_Number_of_Processes, Output_D-Infinity_Drop_to_Stream_Grid) ",
    "parameters": [
      {
        "parameterName": "Input_D-Infinity_Flow_Direction_Grid",
        "description": [
          "A grid giving flow directions by the D-Infinity method. This is usually the output of the D-Infinity Flow Directions tool. Flow direction is measured in radians, counter clockwise from east. The algorithm is described in Tarboton, D. G., (1997), \"A New Method for the Determination of Flow Directions and Contributing Areas in Grid Digital Elevation Models,\" Water Resources Research, 33(2): 309-319"
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Pit_Filled_Elevation_Grid",
        "description": [
          "This input is a grid of elevation values. As a general rule, it is recommended that you use a grid of elevation values that have had the pits removed for this input. Pits are generally taken to be artifacts that interfere with the analysis of flow across them. This grid can be obtained as the output of the \"Pit Remove\" tool, in which case it contains elevation values where the pits have been filled to the point where they just drain."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Stream_Raster_Grid",
        "description": [
          "A grid indicating streams, by using a grid cell value of 1 on streams and 0 off streams. This is usually the output of one of the tools in the \"Stream Network Raster\" toolset."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Weight_Path_Grid (Optional)",
        "description": [
          "A grid giving weights (loadings) to be used in the distance calculation. This might be used for example where only flow distance through a buffer is to be calculated. The weight is then 1 in the buffer and 0 outside it. Alternatively the weight may reflect some sort of cost function for travel over the surface, perhaps representing travel time or attenuation of a process. If this input file is not used, the loadings will assumed to be one for each grid cell."
        ],
        "dataType": "Raster Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_D-Infinity_Drop_to_Stream_Grid",
        "description": [
          "Creates a grid containing the distance to stream calculated using the D-infinity flow model and the statistical and path methods chosen."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Statistical_Method",
        "description": [
          "Statistical method used to calculate the distance down to the stream. In the D-infinity flow model, the outflow from each grid cell is proportioned between two downslope grid cells. Therefore, the distance from any grid cell to a stream is not uniquely defined. Flow that originates at a particular grid cell may enter the stream at a number of cells. The distance to the stream may be defined as the longest, shortest or weighted average of the distance down to the stream."
        ],
        "dataType": "String",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Distance_Method",
        "description": [
          "Distance method used to calculate the distance down to the stream. One of several ways of measuring distance may be selected: the total straight line path (Pythagoras), the horizontal component of the straight line path, the vertical component of the straight line path, or the total surface flow path."
        ],
        "dataType": "String",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Check_for_edge_contamination",
        "description": [
          "A flag that determines whether the tool should check for edge contamination. This is defined as the possibility that a value may be underestimated due to grid cells outside of the domain not being counted. In the context of Distance Down this occurs when part of a flow path traced downslope from a grid cell leaves the domain without reaching a stream grid cell. With edge contamination checking selected, the algorithm recognizes this and reports no data for the result. This is the desired effect and indicates that values for these grid cells is unknown due to it being dependent on terrain outside of the domain of data available. Edge contamination checking may be overridden in cases where you know this is not an issue or want to evaluate the distance using only the fraction of flow paths that terminate at a stream."
        ],
        "dataType": "Boolean",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "This input indicates the number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each piece of the domain."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/DInfinityDecayingAccumulation.html",
    "name": "D-Infinity Decaying Accumulation",
    "description": [
      "The D-Infinity Decaying Accumulation tool creates a grid of the  accumulated quantity at each location in the domain where the quantity  accumulates with the D-infinity flow field, but is subject to first order decay  in moving from cell to cell. By default, the quantity contribution of each grid  cell is the cell length to give a per unit width accumulation, but can  optionally be expressed with a weight grid. The decay multiplier grid gives the  fractional (first order) reduction in quantity in accumulating from grid cell x  to the next downslope cell. "
    ],
    "usage": "mpiexec -n <number of processes>  DinfDecayAccum    -ang  <angfile>   -dm  <dmfile>   -dsca < dscafile > [   -o  <outletfile>] [   -wg  <wgfile>] [   -nc ] [  -lyrname   <layer name>] [  -lyrno  <layer  number>] angfile: Dinf flow direction input file dmfile: Input decay multiplier grid (distance down grid) dscafile: Output decayed specific catchment area grid outletfile: input outlets file (OGR readable  dataset) wgfile: Input weight grid (optional) nc: Flag for edge contamination layer name: OGR layer name if outlets are not the first layer in  outletfile (optional) layer number: OGR layer number if outlets are not the first layer  in outletfile (optional) Layer name and layer number should not both be  specified.",
    "syntax": "DInfDecayingAccumulation  (Input_D-Infinity_Flow_Direction_Grid, Input_Decay_Multiplier_Grid,  {Input_Weight_Grid}, {Input_Outlets}, Check_for_Edge_Contamination,  Input_Number_of_Processes, Output_Decayed_Specific_Catchment_Area_Grid)  ",
    "parameters": [
      {
        "parameterName": "Input_D-Infinity_Flow_Direction_Grid",
        "description": [
          "A grid giving flow direction by the D-infinity method. Flow direction is measured in radians, counter clockwise from east. This grid can be created by the function D-Infinity Flow Directions . The D-infinity algorithm is described in Tarboton, D. G., (1997), \"A New Method for the Determination of Flow Directions and Contributing Areas in Grid Digital Elevation Models,\" Water Resources Research, 33(2): 309-319."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Decay_Multiplier_Grid",
        "description": [
          "A grid giving the factor by which flow leaving each grid cell is multiplied before accumulation on downslope grid cells. This may be used to simulate the movement of an attenuating substance."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Weight_Grid (Optional)",
        "description": [
          "A grid giving weights (loadings) to be used in the accumulation. If this optional grid is not specified, weights are taken as the linear grid cell size to give a per unit width accumulation."
        ],
        "dataType": "Raster Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Outlets (Optional)",
        "description": [
          "This optional input is a point feature  defining outlets of interest. If this input is used, the tool will only evaluate ther area upslope of these outlets."
        ],
        "dataType": "Feature Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Decayed_Specific_Catchment_Area_Grid",
        "description": [
          "The D-Infinity Decaying Accumulation tool creates a grid of the accumulated mass at each location in the domain where mass moves with the D-infinity flow field, but is subject to first order decay in moving from cell to cell."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Check_for_Edge_Contamination",
        "description": [
          "This checkbox determines whether the tool should check for edge contamination. Edge contamination is defined as the possibility that a value may be underestimated due to grid cells outside of the domain not being considered when determining contributing area. This occurs when drainage is inwards from the boundaries or areas with no data values for elevation. The algorithm recognizes this possibility and reports no data for the result. It is common to see streaks of no data values extending inwards from boundaries along flow paths that enter the domain at a boundary. This is the desired effect, and indicates that values for these grid cells is unknown due to it being dependent on terrain outside of the available data. Edge contamination checking may be overridden in cases where you know it is not an issue, or want to ignore the problems, if for example, the DEM has been clipped along a watershed outline."
        ],
        "dataType": "Boolean",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "This input indicates the number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each piece of the domain."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/DInfinityConcentrationLimitedAccumulation.html",
    "name": "D-Infinity Concentration Limited Acccumulation",
    "description": [
      "This function applies to the situation where an unlimited supply of a  substance is loaded into flow at a concentration or solubility threshold Csol  over a region indicated by an indicator grid (dg). It a grid of the  concentration of a substance at each location in the domain, where the supply of  substance from a supply area is loaded into the flow at a concentration or  solubility threshold. The flow is first calculated as a D-infinity weighted  contributing area of an input Effective Runoff Weight Grid (notionally excess  precipitation). The concentation of substance over the supply area (indicator  grid) is at the concentration threshold. As the substance moves downslope with  the D-infinity flow field, it is subject to first order decay in moving from  cell to cell as well as dilution due to changes in flow. The decay multiplier  grid gives the fractional (first order) reduction in quantity in moving from  grid cell x to the next downslope cell. If the input outlets is used, the tool  only evaluates the part of the domain that contributes flow to the locations  given by the outlets. This is useful for a tracking a contaminant or compound  from an area with unlimited supply of that compound that is loaded into a flow  at a concentration or solubility threshold over a zone and flow from the zone  may be subject to decay or attenuation."
    ],
    "usage": "mpiexec -n <number of processes>  DinfConcLimAccum   -ang  <angfile>   -dg  <dgfile>   -dm  <dmfile>   -ctpt  < ctptfile >   -q  <qfile> [   -csol  ] [  -o  <outletfile>] [  -wg  <wgfile>] [  -nc ] [  -lyrname   <layer name>] [  -lyrno  <layer  number>] angfile:Dinf flow direction input grid dgfile: Input disturbance indicator grid dmfile: decay multiplier grid ctptfile: Output concentration grid.  qfile: Specific discharge grid.  wgfile: Input weight grid (optional) outletfile: input outlets file (OGR readable dataset) csol: Concentration threshold nc: Flag for edge contamination layer name: OGR layer name if outlets are not the first layer in  outletfile (optional) layer number: OGR layer number if outlets are not the first layer  in outletfile (optional) Layer name and layer number should not both be  specified.",
    "syntax": "DInfConcLimitedAcccum  (Input_D-Infinity_Flow_Direction_Grid, Input_Effective_Runoff_Weight_Grid,  Input_Disturbance_Indicator_Grid, Input_Decay_Multiplier_Grid, {Input_Outlets},  Concentration_Threshold, Check_for_Edge_Contamination,  Input_Number_of_Processes, Output_Overland_Flow_Specific_Discharge_Grid,  Output_Concentration_Grid) ",
    "parameters": [
      {
        "parameterName": "Input_D-Infinity_Flow_Direction_Grid",
        "description": [
          "A grid giving flow direction by the D-infinity method. Flow direction is measured in radians, counter clockwise from east. This can be created by the tool D-Infinity Flow Directions . The algorithm is described in Tarboton, D. G., (1997), \"A New Method for the Determination of Flow Directions and Contributing Areas in Grid Digital Elevation Models,\" Water Resources Research, 33(2): 309-319."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Effective_Runoff_Weight_Grid",
        "description": [
          "A grid giving the input quantity (notionally effective runoff or excess precipitation) to be used in the D-infinity weighted contributing area evaluation of Overland Flow Specific Discharge."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Disturbance_Indicator_Grid",
        "description": [
          "A grid that indicates the source zone of the area of substance supply and must be 1 inside the zone and 0 or \"no data\" over the rest of the domain."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Decay_Multiplier_Grid",
        "description": [
          "A grid giving the factor by which flow leaving each grid cell is multiplied before accumulation on downslope grid cells. This may be used to simulate the movement of an attenuating or decaying substance. If travel (or residence) times t(x) associated with flow between cells are available d(x) may be evaluated as exp(-k t(x)) where k is a first order decay parameter."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Outlets (Optional)",
        "description": [
          "This optional input is a point feature  defining outlets of interest. If this input is used, the tool will only evaluate the area upslope of these outlets."
        ],
        "dataType": "Feature Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Overland_Flow_Specific_Discharge_Grid",
        "description": [
          "The grid giving the specific discharge of the flow carrying the constituent being loaded at the concentration threshold specified. This is the D-infinity weighted accululation of the Effective Runoff Input Weight Grid."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Concentration_Grid",
        "description": [
          "A grid giving the resulting concentration of the compound of interest in the flow."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Concentration_Threshold",
        "description": [
          "The concentration or solubility threshold. Over the substance supply area, concentration is at this threshold."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Check_for_Edge_Contamination",
        "description": [
          "This checkbox determines whether the tool should check for edge contamination. Edge contamination is defined as the possibility that a value may be underestimated due to grid cells outside of the domain not being considered. This occurs when drainage is inwards from the boundaries or areas with no data values for elevation. The algorithm recognizes this possibility and reports no data for the result. It is common to see streaks of no data values extending inwards from boundaries along flow paths that enter the domain at a boundary. This is the desired effect, and indicates that values for these grid cells is unknown due to it being dependent on terrain outside of the available data. Edge contamination checking may be overridden in cases where you know it is not an issue, or want to ignore the problems, if for example, the DEM has been clipped along a watershed outline."
        ],
        "dataType": "Boolean",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "This input indicates the number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each piece of the domain."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/DInfinityAvalancheRunout.html",
    "name": "D-Infinity Avalanche Runout",
    "description": [
      "Identifies an avalanche's affected area and the flow path length to each cell in that affacted area. All cells downslope from each source area cell, up to the point where the slope from the source to the affected area is less than a threshold angle called the Alpha Angle can be in the affected area. This tool uses the D-infinity multiple flow direction method for determining flow direction. This will likely cause very small amounts of flow to be dispersed to some downslope cells that might overstate the affected area, so a threshold proportion can be set to avoid this excess dispersion. The flow path length is the distance from the cell in question to the source cell that has the highest angle.",
     "All points downslope from the source area are potentially in the  affected area, but not beyond a point where the slope from the source to the  affected area is less than a threshold angle called the Alpha  Angle."
    ],
    "usage": "mpiexec -n <number of processes>  DinfAvalanche -ang  <angfile>   -fel  <felfile>   -ass  <assfile>   -rz  < rzfile >   -dfs  < dfsfile > [   -thresh  ] [  -alpha  ] [  -direct ] angfile: Input Dinf flow direction grid felfile: Input pit filled elevation grid assfile: Input avalanche source site grid rzfile: Output avalanche runout zone grid. The values output are  actually the alpha angles from the source zone to each grid cell. All will be greater than the input alpha  threshold angle. dfsfile: Output distance down (path distance) grid thresh: Input proportion threshold alpha: Input angle threshold direct: Flag to indicate whether distance is measured along flow path  (default) or as a straight line from source to grid cell (if direct is given). Distances are horizontal  distances in both cases.",
    "syntax": "DInfAvalancheRunout  (Input_Pit_Filled_Elevation_Grid, Input_D-Infinity_Flow_Direction_Grid,  Input_Avalanche_Source_Site_Grid, Input_Proportion_Threshold,  Input_Alpha_Angle_Threshold, Path_Distance_Method, Input_Number_of_Processes,  Output_Runout_Zone_Grid, Output_Path_Distance_Grid) ",
    "parameters": [
      {
        "parameterName": "Input_Pit_Filled_Elevation_Grid",
        "description": [
          "A grid of elevation values. This is usually the output of the \"Fill Pits\" tool, in which case it is elevations with pits removed. Pits are low elevation areas in digital elevation models (DEMs) that are completely surrounded by higher terrain. They are generally taken to be artifacts that interfere with the processing of flow across DEMs, so are removed by raising their elevation to the point where they just drain. This step is not essential if you have reason to believe that the pits in your DEM are real."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_D-Infinity_Flow_Direction_Grid",
        "description": [
          "A grid giving flow directions by the D-Infinity method. This is usually the output of the D-Infinity Flow Directions tool. Flow direction is measured in radians, counter clockwise from east. The algorithm is described in Tarboton, D. G., (1997), \"A New Method for the Determination of Flow Directions and Contributing Areas in Grid Digital Elevation Models,\" Water Resources Research, 33(2): 309-319"
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Avalanche_Source_Site_Grid",
        "description": [
          "This is a grid of source areas for snow avalanches that are commonly identified manually using a mix of experience and visual interpretation of maps. Avalanche source sites are to be input as a short integer grid (name suffix *ass, e.g. demass) comprised of positive values where avalanches may be triggered and 0 values  elsewhere."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Proportion_Threshold",
        "description": [
          "This value is a threshold proportion that is used to limit the disperson of flow caused by using the D-infinity multiple flow direction method for determining flow direction. The D-infinity multiple flow direction method often causes very small amounts of flow to be dispersed to some downslope cells that might overstate the affected area, so a threshold proportion can be set to avoid this excess dispersion."
        ],
        "dataType": "Double",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Alpha_Angle_Threshold",
        "description": [
          "This value is the threshold angle, called the Alpha Angle, that is used to determine which of the cells downslope from the source cells are in the affected area. Only the cells downslope from each source area cell, up to the point where the slope from the source to the affected area is less than a threshold angle are in the affected area."
        ],
        "dataType": "Double",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Runout_Zone_Grid",
        "description": [
          "This grid Identifies the avalanche's runout zone (affected area) using a runout zone indicator with value 0 to indicate that this grid cell is not in the runout zone and value > 0 to indicate that this grid cell is in the runout zone. Since there may be information in the angle to the associated source site, this variable will be assigned the angle to the source site (in degrees)."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Path_Distance_Grid",
        "description": [
          "This is a grid of the flow distance from the source site that has the highest angle to each cell."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Path_Distance_Method",
        "description": [
          "This option selects the method used to measure the distance used to calculate the slope angle. The Flow Path option measures it along the flow path, where the Straight Line option causes the slope to be measure along the straight line distance from the source cell to the evaluation cell."
        ],
        "dataType": "String",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "This input indicates the number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each piece of the domain."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/WatershedGridToShapefile.html",
    "name": "Watershed Grid To Shapefile",
    "description": [],
    "usage": "",
    "syntax": null,
    "parameters": [
      {
        "parameterName": "Input_Watershed_Grid",
        "description": [
          "A grid demarcating each reach watershed."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Watershed_Shapefile",
        "description": [
          "A polygon shapefile demarcating each reach watershed. The only attribute of this shapefile is polygon_id, identifier. This corresponds with the WSNO watershed number in the Stream Reach shapefile (*net.shp) and value in the Watershed Grid (*w)."
        ],
        "dataType": "Shapefile",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": []
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/StreamReachAndWatershed.html",
    "name": "Stream Reach And Watershed",
    "description": [
      "This tool produces a vector network and OGR file from the stream raster  grid. The flow direction grid is used to connect flow paths along the stream  raster. The Strahler order of each stream segment is computed. The subwatershed  draining to each stream segment (reach) is also delineated and labeled with the  value identifier that corresponds to the WSNO (watershed number) attribute in  the Stream Reach OGR file.",
      "This tool orders the stream network according to the Strahler  ordering system. Streams that don't have any other streams draining in to them  are order 1. When two stream reaches of different order join the order of the  downstream reach is the order of the highest incoming reach. When two reaches of  equal order join the downstream reach order is increased by 1. When more than  two reaches join the downstream reach order is calculated as the maximum of the  highest incoming reach order or the second highest incoming reach order + 1.  This generalizes the common definition to cases where more than two reaches join  at a point. The network topological connectivity is stored in the Stream Network  Tree file, and coordinates and attributes from each grid cell along the network  are stored in the Network Coordinates file.",
      "The stream raster grid is used as the source for the stream network,  and the flow direction grid is used to trace connections within the stream  network. Elevations and contributing area are used to determine the elevation  and contributing area attributes in the network coordinate file. Points in the  outlets file are used to logically split stream reaches to facilitate  representing watersheds upstream and downstream of monitoring points. The  program uses the attribute field \"id\" in the outlets file as identifiers in the  Network Tree file. This tool then translates the text file vector network  representation in the Network Tree and Coordinates files into a polyline OGR  file. Further attributes are also evaluated. The program has an option to  delineate a single watershed by representing the entire area draining to the  Stream Network as a single value in the output watershed  grid."
    ],
    "usage": "mpiexec -n <number of processes>  StreamNet   -fel  <felfile>   -p  <pfile>   -ad8  <ad8file>   -src  <srcfile>   -ord  < ordfile >   -tree  < treefile >   -coord < coordfile >   -net  < netfile > [   -netlyr  netlayername] [   -o  <outletfile>] [   -lyrname  <layer  name>] [  -lyrno   <layer number>]  -w   < wfile > [   -sw ] pfile: Input D8 flow directions grid 'p' srcfile: Input stream raster grid 'src' ordfile: Output grid of channel network Strahler order 'ord' ad8file: Input grid with D8 contributing area 'ad8' felfile: Input pit filled elevation data grid 'fel' treefile: Output textfile with list of links in channel network  tree coordfile: Output textfile with list of coordinates in channel network  tree outletfile: input outlets file (OGR readable dataset). This  must contain a field named \"id\" that is used to identify the links upstream of outlet points layer name: OGR layer name if outlets are not the first layer in  outletfile (optional) layer number: OGR layer number if outlets are not the first layer  in outletfile (optional) Layer name and layer number should not both be  specified. wfile: Output grid of watershed identifiers 'w' netfile: Output file (OGR writeable data set) of resultant channel  network. netlayername: layer name of netfile (Optional)",
    "syntax": "StreamReachAndWatershed  (Input_Pit_Filled_Elevation_Grid, Input_D8_Flow_Direction_Grid,  Input_D8_Drainage_Area, Input_Stream_Raster_Grid, {Input_Outlets},  Delineate_Single_Watershed, Input_Number_of_Processes, Output_Stream_Order_Grid,  Output_Network_Connectivity_Tree, Output_Network_Coordinates,  Output_Stream_Reach_file, Output_Watershed_Grid) ",
    "parameters": [
      {
        "parameterName": "Input_Pit_Filled_Elevation_Grid",
        "description": [
          "This input is a grid of elevation values. This is usually the output of the \"Pit Remove\" tool, in which case it is elevations with pits removed. Pits are low elevation areas in digital elevation models (DEMs) that are completely surrounded by higher terrain. They are generally taken to be artifacts that interfere with the processing of flow across DEMs, so are removed by raising their elevation to the point where they just drain. This step is not essential if you have reason to believe that the pits in your DEM are real. Elevation values are used in this function to compute the slope of stream segments. Not removing pits can result in negative (i.e. uphill) stream segment slopes."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_D8_Flow_Direction_Grid",
        "description": [
          "This input is a grid of flow directions that are encoded using the D8 method where all flow from a cells goes to a single neighboring cell in the direction of steepest descent."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_D8_Drainage_Area",
        "description": [
          "A grid giving the contributing area value in terms of the number of grid cells (or the summation of weights) for each cell taken as its own contribution plus the contribution from upslope neighbors that drain in to it using the D8 algorithm. This is usually the output of the \"D8 Contributing Area\" tool and is used to determine the contributing area attribute in the Network Coordinate file."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Stream_Raster_Grid",
        "description": [
          "An indicator grid indicating streams, by using a grid cell value of 1 on streams and 0 off streams. Several of the \"Stream Network Analysis\" tools produce this type of grid. The Stream Raster Grid is used as the source for the stream network."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Outlets (Optional)",
        "description": [
          "A point feature defining points of interest. If this input used, the tool will only deliiniate the stream network upstream of these outlets. Additionally, points in the Outlets feature  are used to logically split stream reaches to facilitate representing watersheds upstream and downstream of monitoring points. This tool REQUIRES THAT THERE BE an integer attribute field \"id\" in the Outlets feature layer, because the \"id\" values are used as identifiers in the Network Tree file."
        ],
        "dataType": "Feature Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Stream_Order_Grid",
        "description": [
          "The Stream Order Grid has cells values of streams ordered according to the Strahler order system. The Strahler ordering system defines order 1 streams as stream reaches that don't have any other reaches draining in to them. When two stream reaches of different order join the order of the downstream reach is the order of the highest incoming reach. When two reaches of equal order join the downstream reach order is increased by 1. When more than two reaches join the downstream reach order is calculated as the maximum of the highest incoming reach order or the second highest incoming reach order + 1. This generalizes the common definition to cases where more than two reaches join at a point. This generalizes the common definition to cases where more than two flow paths join at a point."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Network_Connectivity_Tree",
        "description": [
          "This output is a text file that details the network topological connectivity is stored in the Stream Network Tree file. Columns are as follows:",
          "Link Number (Arbitrary - will vary depending on number of   processes used) ",
          "Start Point Number in Network coordinates (*coord.dat)   file (Indexed from 0) ",
          "End Point Number in Network coordinates (*coord.dat) file   (Indexed from 0) ",
          "Next (Downstream) Link Number. Points to Link Number. -1   indicates no links downstream, i.e. a terminal link   ",
          "First Previous (Upstream) Link Number. Points to Link   Number. -1 indicates no upstream links. ",
          "Second Previous (Upstream) Link Numbers. Points to Link   Number. -1 indicates no upstream links. Where only one previous link is   -1, it indicates an internal monitoring point where the reach is   logically split, but the network does not bifurcate.   ",
          "Strahler Order of Link ",
          "Monitoring point identifier at downstream end of link. -1   indicates downstream end is not a monitoring point.   ",
          "Network magnitude of the link, calculated as the number   of upstream sources (following Shreve). "
        ],
        "dataType": "File",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Network_Coordinates",
        "description": [
          "This output is a text file that contains the coordinates and attributes of points along the stream network. Columns are as follows:",
          "X coordinate ",
          "Y Coordinate ",
          "Distance along channels to the downstream end of a   terminal link ",
          "Elevation ",
          "Contributing area "
        ],
        "dataType": "File",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Stream_Reach_file",
        "description": [
          "This output is a polyline OGR file giving the links in a stream network. The columns in the attribute table are:",
          "LINKNO- Link Number. A unique number associated with each link (segment of channel between junctions). This is arbitrary and will vary depending on number of processes used.",
          "DSLINKNO - Link Number of the downstream link. -1 indicates that this does not exist.",
          "USLINKNO1 - Link Number of first upstream link. (-1 indicates no link upstream, i.e. for a source link)",
          "USLINKNO2 - Link Number of second upstream link. (-1 indicates no second link upstream, i.e. for a source link or an internal monitoring point where the reach is logically split but the network does not bifurcate.)",
          "DSNODEID - Node identifier for node at downstream end of stream reach. This identifier corresponds to the \"id\" attribute from the Outlets shapefile used to designate nodes.",
          "strmOrder - Strahler Stream Order",
          "Length - Length of the link. The units are the horizontal map units of the underlying DEM grid.",
          "Magnitude - Shreve Magnitude of the link. This is the total number of sources upstream",
          "DSContArea - Drainage area at the downstream end of the link. Generally this is one grid cell upstream of the downstream end because the drainage area at the downstream end grid cell includes the area of the stream being joined.",
          "strmDrop - Drop in elevation from the start to the end of the link",
          "Slope - Average slope of the link (computed as drop/length)",
          "StraightL - Straight line distance from the start to the end of the link",
          "USContArea - Drainage area at the upstream end of the link",
          "WSNO - Watershed number. Cross reference to the *w.shp and *w grid files giving the identification number of the watershed draining directly to the link.",
          "DOUTEND - Distance to the eventual outlet (i.e. the most downstream point in the stream network) from the downstream end of the link.",
          "DOUTSTART - Distance to the eventual outlet from the upstream end of the link",
          "DOUTMID - Distance to the eventual outlet from the midpoint of the link"
        ],
        "dataType": "File",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Watershed_Grid",
        "description": [
          "This output grid identified each reach watershed with a unique ID number, or in the case where the delineate single watershed option was checked, the entire area draining to the stream network is identified with a single ID."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Delineate_Single_Watershed",
        "description": [
          "This option causes the tool to delineate a single watershed by representing the entire area draining to the Stream Network as a single value in the output watershed grid. Otherwise a seperate watershed is delineated for each stream reach."
        ],
        "dataType": "Boolean",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "This input indicates the number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each piece of the domain."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/StreamDropAnalysis.html",
    "name": "Stream Drop Analysis",
    "description": [
      "Applies a series of thresholds (determined from the input parameters)  to the input accumulated stream source grid (*ssa) grid and outputs the results  in the *drp.txt file the stream drop statistics table. This function is designed  to aid in the determination of a geomorphologically objective threshold to be  used to delineate streams. Drop Analysis attempts to select the right threshold  automatically by evaluating a stream network for a range of thresholds and  examining the constant drop property of the resulting Strahler streams.  Basically it asks the question: Is the mean stream drop for first order streams  statistically different from the mean stream drop for higher order streams,  using a T-Test. Stream drop is the difference in elevation from the beginning to  the end of a stream defined as the sequence of links of the same stream order.  If the T test shows a significant difference then the stream network does not  obey this \"law\" so a larger threshold needs to be chosen. The smallest threshold  for which the T test does not show a significant difference gives the highest  resolution stream network that obeys the constant stream drop \"law\" from  geomorphology, and is the threshold chosen for the \"objective\" or automatic  mapping of streams from the DEM. This function can be used in the development of  stream network rasters, where the exact watershed characteristic(s) that were  accumulated in the accumulated stream source grid vary based on the method being  used to determine the stream network raster."
    ],
    "usage": "mpiexec -n <number of processes>  DropAnalysis   -fel  <felfile>  -p  <pfile>  -ad8   <ad8file>  -ssa   <ssafile>  -drp   < drpfile >   -o  <outletfile> [   -lyrname  <layer  name>] [  -lyrno   <layer number>] [  -par   5 500 10 0] ad8file: File name for D8 contributing area grid 'ad8' pfile: File name for D8 flow direction grid 'p' felfile: File name for hydrologically correct elevation grid  'fel' ssafile: File name for an accumulated stream source grid suitable for  drop analysis. This needs to have the property that it is monotonically increasing downslope along D8  flow directions. outletfile: input outlets file (OGR readable  dataset) layer name: OGR layer name if outlets are not the first layer in  outletfile (optional) layer number: OGR layer number if outlets are not the first layer  in outletfile (optional) Layer name and layer number should not both be  specified. dropfile: File name where stream drop analysis output is to  be written as txt par: Array of parameters consisting of: - threshmin: Minimum value of threshold to be used in drop  analysis - threshmax: Maximum value of threshold to be used in drop  analysis - nthresh: Number of drop thresholds to be used in drop  analysis - steptype: Type of threshold step to be used in drop analysis (0 =  log, 1=arithmetic) The default parameter values of min=5, max=500, nthresh=10, steptype=0  are assumed unless -par is specified.",
    "syntax": "StreamDropAnalysis  (Input_Pit_Filled_Elevation_Grid, Input_D8_Flow_Direction_Grid,  Input_D8_Contributing_Area_Grid, Input_Accumulated_Stream_Source_Grid,  Input_Outlets, Minimum_Threshold_Value, Maximum_Threshold_Value,  Number_of_Threshold_Values, Use_logarithmic_spacing_for_threshold_values,  Input_Number_of_Processes, Output_Drop_Analysis_Text_File) ",
    "parameters": [
      {
        "parameterName": "Input_Pit_Filled_Elevation_Grid",
        "description": [
          "A grid of elevation values. This is usually the output of the \"Pit Remove\" tool, in which case it is elevations with pits removed. Pits are low elevation areas in digital elevation models (DEMs) that are completely surrounded by higher terrain. They are generally taken to be artifacts of the digitation process that interfere with the processing of flow across DEMs. So they are removed by raising their elevation to the point where they just drain off the domain. This step is not essential if you have reason to believe that the pits in your DEM are real, but with drop analysis ensures that the elevation drop downstream along a stream is positive."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_D8_Flow_Direction_Grid",
        "description": [
          "A grid of D8 flow directions which are defined, for each cell, as the direction of the one of its eight adjacent or diagonal neighbors with the steepest downward slope."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_D8_Contributing_Area_Grid",
        "description": [
          "A grid of contributing area values for each cell that were calculated using the D8 algorithm. The contributing area for a cell is the sum of its own contribution plus the contribution from all upslope neighbors that drain to it, measured as a number of cells or the sum of weight loadings. This grid can be obtained as the output of the \"D8 Contributing Area\" tool. This grid is used in the evaluation of drainage density reported in the stream drop table."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Accumulated_Stream_Source_Grid",
        "description": [
          "This grid must be monotonically increasing along the downslope D8 flow directions. It it compared to a series of thresholds to determine the beginning of the streams. It is often generated by accumulating some characteristic or combination of characteristics of the watershed with the \"D8 Contributing Area\" tool, or using the maximum option of the \"D8 Flow Path Extreme\" tool. The exact method varies depending on the algorithm being used."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Outlets",
        "description": [
          "A point feature defining the outlets upstream of which drop analysis is performed."
        ],
        "dataType": "Feature Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Drop_Analysis_Text_File",
        "description": [
          "This is a comma delimited text file with the following header line:",
          "Threshold, DrainDen, NoFirstOrd, NoHighOrd, MeanDFirstOrd, MeanDHighOrd, StdDevFirstOrd, StdDevHighOrd, T",
          "The file then contains one line of data for each threshold value examined, and then a summary line that indicates the optimum threshold value. This technique looks for the smallest threshold in the range where the absolute value of the t-statistic is less than 2. For the science behind the drop analysis, see Tarboton et al. (1991, 1992), Tarboton and Ames (2001)."
        ],
        "dataType": "File",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Minimum_Threshold_Value",
        "description": [
          "This parameter is the lowest end of the range searched for possible threshold values using drop analysis. This technique looks for the smallest threshold in the range where the absolute value of the t-statistic is less than 2. For the science behind the drop analysis see Tarboton et al. (1991, 1992), Tarboton and Ames (2001)."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Maximum_Threshold_Value",
        "description": [
          "This parameter is the highest end of the range searched for possible threshold values using drop analysis. This technique looks for the smallest threshold in the range where the absolute value of the t-statistic is less than 2. For the science behind the drop analysis see Tarboton et al. (1991, 1992), Tarboton and Ames (2001)."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Number_of_Threshold_Values",
        "description": [
          "The parameter is the number of steps to divide the search range into when looking for possible threshold values using drop analysis. This technique looks for the smallest threshold in the range where the absolute value of the t-statistic is less than 2. For the science behind the drop analysis see Tarboton et al. (1991, 1992), Tarboton and Ames (2001)."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Use_logarithmic_spacing_for_threshold_values",
        "description": [
          "This checkbox indicates whether logarithmic or linear spacing should be used when looking for possible threshold values using drop ananlysis."
        ],
        "dataType": "Boolean",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "The number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each of the stripes."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/StreamDefinitionWithDropAnalysis.html",
    "name": "Stream Definition With Drop Analysis",
    "description": [
      "This tool combines the function of the \"Stream Drop Analysis\"  tool and the \"Stream Definition by Threshold\" tool. It applies a series of  thresholds (determined from the input parameters) to the input accumulated  stream source grid (*ssa) grid and outputs the results in the stream drop  statistics table (*drp.txt). Then it outputs a stream raster grid, which is an  indicator (1,0) grid of stream cells. Stream cells are defined as those cells  where the accumulated stream source value is >= the optimal threshold as  determined from the stream drop statistics. There is an option to include a mask  input to replicate the functionality for using the *sca file as an edge  contamination mask. The threshold logic should be: src = ((ssa >= thresh)  & (mask >=0)) ? 1:0"
    ],
    "usage": "There is no usage for this tool.",
    "syntax": "StreamDefWithDropAnalysis  (Input_Pit_Filled_Elevation_Grid, Input_D8_Flow_Direction_Grid,  Input_D8_Contributing_Area_Grid, Input_Accumulated_Stream_Source_Grid,  Input_Outlets, {Input_Mask_Grid}, Minimum_Threshold_Value,  Maximum_Threshold_Value, Number_of_Threshold_Values,  Use_logarithmic_spacing_for_threshold_values, Input_Number_of_Processes,  Output_Drop_Analysis_Text_File, Output_Stream_Raster_Grid) ",
    "parameters": [
      {
        "parameterName": "Input_Pit_Filled_Elevation_Grid",
        "description": [
          "This input is a grid of elevation values. As a general rule, it is recommended that you use a grid of elevation values that have had the pits removed for this input. Pits are generally taken to be artifacts that interfere with the analysis of flow across them. This grid can be obtained as the output of the \"Pit Remove\" tool, in which case it contains elevation values where the pits have been filled to the point where they just drain."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_D8_Flow_Direction_Grid",
        "description": [
          "A grid of D8 flow directions which are defined, for each cell, as the direction of the one of its eight adjacent or diagonal neighbors with the steepest downward slope."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_D8_Contributing_Area_Grid",
        "description": [
          "A grid of contributing area values for each cell that were calculated using the D8 algorithm. The contributing area for a cell is the sum of its own contribution plus the contribution from all upslope neighbors that drain to it, measured as a number of cells or the sum of weight loadings. This grid can be obtained as the output of the \"D8 Contributing Area\" tool. In this tool, it is the contributing area (A) that is compared in the formula A > ML^y to determine the transition to a stream."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Accumulated_Stream_Source_Grid",
        "description": [
          "This grid nominally accumulates some characteristic or combination of characteristics of the watershed. The exact characteristic(s) varies depending on the stream network raster algorithm being used. This grid needs to have the property that grid cell values are monotonically increasing downslope along D8 flow directions, so that the resulting stream network is continuous. While this grid is often from an accumulation, other sources such as a maximum upslope function will also produce a suitable grid."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Outlets",
        "description": [
          "A point feature  defining the outlets of interest. If this input file is used, only the cells upslope of these outlet cells are considered to be within the domain being evaluated."
        ],
        "dataType": "Feature Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Mask_Grid (Optional)",
        "description": [
          "This optional input is a grid that is used to mask the domain of interest and output is only provided where this grid is >= 0. A common use of this input is to use a D-Infinity contributing area grid as the mask so that the delineated stream network is constrained to areas where D-infinity contributing area is available, replicating the functionality of an edge contamination mask."
        ],
        "dataType": "Raster Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Drop_Analysis_Text_File",
        "description": [
          "This is a comma delimited text file with the following header line:",
          "Threshold, DrainDen, NoFirstOrd, NoHighOrd, MeanDFirstOrd, MeanDHighOrd, StdDevFirstOrd, StdDevHighOrd, T",
          "The file then contains one line of data for each threshold value examined, and then a summary line that indicates the optimum threshold value. This technique looks for the smallest threshold in the range where the absolute value of the t-statistic is less than 2. For the science behind the drop analysis, see Tarboton et al. (1991, 1992), Tarboton and Ames (2001)."
        ],
        "dataType": "File",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_Stream_Raster_Grid",
        "description": [
          "This is an indicator grid (1,0) that indicates the location of streams, with a value of 1 for each of the stream cells and 0 for the remainder of the cells."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Minimum_Threshold_Value",
        "description": [
          "This parameter is the lowest end of the range searched for possible threshold values using drop analysis. This technique looks for the smallest threshold in the range where the absolute value of the t-statistic is less than 2. For the science behind the drop analysis see Tarboton et al. (1991, 1992), Tarboton and Ames (2001)."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Maximum_Threshold_Value",
        "description": [
          "This parameter is the highest end of the range searched for possible threshold values using drop analysis. This technique looks for the smallest threshold in the range where the absolute value of the t-statistic is less than 2. For the science behind the drop analysis see Tarboton et al. (1991, 1992), Tarboton and Ames (2001)."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Number_of_Threshold_Values",
        "description": [
          "The parameter is the number of steps to divide the search range into when looking for possible threshold values using drop analysis. This technique looks for the smallest threshold in the range where the absolute value of the t-statistic is less than 2. For the science behind the drop analysis see Tarboton et al. (1991, 1992), Tarboton and Ames (2001)."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Use_logarithmic_spacing_for_threshold_values",
        "description": [
          "This checkbox indicates whether logarithmic or linear spacing should be used when looking for possible threshold values using drop ananlysis."
        ],
        "dataType": "Boolean",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "The number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each of the stripes."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/StreamDefinitionByThreshold.html",
    "name": "Stream Definition By Threshold",
    "description": [
      "Operates on any grid and outputs an indicator (1,0) grid identifing  cells with input values >= the threshold value. The standard use is to use an  accumulated source area grid to as the input grid to generate a stream raster  grid as the output. If you use the optional input mask grid, it limits the  domain being evaluated to cells with mask values >= 0 . When you use a  D-infinity contributing area grid (*sca) as the mask grid, it functions as an  edge contamination mask. The threshold logic is: src = ((ssa >= thresh) &  (mask >=0)) ? 1:0 ."
    ],
    "usage": "mpiexec -n <number of processes>  Threshold      -ssa  <ssafile>   -src  < srcfile >   -thresh  100.0 [   -mask  maskfile] Default threshold value is 100.0 ssafile: File name for grid to be thresholded. srcfile: File name for stream raster grid. maskfile: File name for grid used to mask the output stream raster, or  general thresholded grid. thresh: Threshold parameter. usemask: Flag to indicate whether maskfile has been input and is to be  used (1 yes, 0 no)",
    "syntax": "StreamDefByThreshold  (Input_Accumulated_Stream_Source_Grid, {Input_Mask_Grid}, Threshold,  Input_Number_of_Processes, Output_Stream_Raster_Grid) ",
    "parameters": [
      {
        "parameterName": "Input_Accumulated_Stream_Source_Grid",
        "description": [
          "This grid nominally accumulates some characteristic or combination of characteristics of the watershed. The exact characteristic(s) varies depending on the stream network raster algorithm being used. This grid needs to have the property that grid cell values are monotonically increasing downslope along D8 flow directions, so that the resulting stream network is continuous. While this grid is often from an accumulation, other sources such as a maximum upslope function will also produce a suitable grid."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Mask_Grid (Optional)",
        "description": [
          "This optional input is a grid that is used to mask the domain of interest and output is only provided where this grid is >= 0. A common use of this input is to use a D-Infinity contributing area grid as the mask so that the delineated stream network is constrained to areas where D-infinity contributing area is available, replicating the functionality of an edge contamination mask."
        ],
        "dataType": "Raster Layer",
        "isOptional": true,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_Stream_Raster_Grid",
        "description": [
          "This is an indicator grid (1,0) that indicates the location of streams, with a value of 1 for each of the stream cells and 0 for the remainder of the cells."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Threshold",
        "description": [
          "This parameter is compared to the value in the Accumulated Stream Source grid (*ssa) to determine if the cell should be considered a stream cell. Streams are identified as grid cells for which ssa value is >= this threshold."
        ],
        "dataType": "Double",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      },
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "The number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each of the stripes."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  },
  {
    "manual_url": "http://hydrology.usu.edu/taudem/taudem5/help53/DInfinityFlowDirections.html",
    "name": "D-Infinity Flow Directions",
    "description": [
      "Assigns a flow direction based on the D-infinity flow method using the  steepest slope of a triangular facet (Tarboton, 1997, \"A New Method for the  Determination of Flow Directions and Contributing Areas in Grid Digital  Elevation Models,\" Water Resources Research, 33(2): 309-319). Flow direction is  defined as steepest downward slope on planar triangular facets on a block  centered grid. Flow direction is encoded as an angle in radians  counter-clockwise from east as a continuous (floating point) quantity between 0  and 2 pi. The flow direction angle is determined as the direction of the  steepest downward slope on the eight triangular facets formed in a 3 x 3 grid  cell window centered on the grid cell of interest. The resulting flow in a grid  is then usually interpreted as being proportioned between the two neighboring  cells that define the triangular facet with the steepest downward  slope."
    ],
    "usage": "mpiexec -n <number of processes>  DinfFlowDir  -fel  < felfile >  -ang  <  angfile   >  -slp  <  slpfile > felfile:Pit filled elevation input data  angfile: Dinf flow directions output  slpfile: Dinf slopes output",
    "syntax": "DinfFlowDir (Input_Pit_FIlled_Elevation_Grid,  Input_Number_of_Processes, Output_D-Infinity_Flow_Direction_Grid,  Output_D-Infinity_Slope_Grid) ",
    "parameters": [
      {
        "parameterName": "Input_Pit_FIlled_Elevation_Grid",
        "description": [
          "A grid of elevation values. This is usually the output of the \"Pit Remove\" tool, in which case it is elevations with pits removed. Pits are low elevation areas in digital elevation models (DEMs) that are completely surrounded by higher terrain. They are generally taken to be artifacts of the digitation process that interfere with the processing of flow across DEMs. So they are removed by raising their elevation to the point where they just drain off the domain. This step is not essential if you have reason to believe that the pits in your DEM are real and can be circumvented using the raw DEM as input here. Also, if a few pits actually exist and so should not be removed, while at the same time others are believed to be artifacts that need to be removed, the actual pits should have \"no data\" elevation values inserted at their lowest point. \"No data\" values serve to define edges of the domain in the flow field, and elevations are only raised to where flow is off an edge, so an internal \"no data\" value will stop a pit from being removed, if necessary."
        ],
        "dataType": "Raster Layer",
        "isOptional": false,
        "isInputFile": true,
        "isOutputFile": false
      },
      {
        "parameterName": "Output_D-Infinity_Flow_Direction_Grid",
        "description": [
          "A grid of flow directions based on the D-infinity flow method using the steepest slope of a triangular facet (Tarboton, 1997, \"A New Method for the Determination of Flow Directions and Contributing Areas in Grid Digital Elevation Models,\" Water Resources Research, 33(2): 309-319). Flow direction is determined as the direction of the steepest downward slope on the 8 triangular facets of a 3 x 3 block centered grid. Flow direction is encoded as an angle in radians, counter-clockwise from east as a continuous (floating point) quantity between 0 and 2 pi. The resulting flow in a grid is then usually interpreted as being proportioned between the two neighboring cells that define the triangular facet with the steepest downward slope."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      },
      {
        "parameterName": "Output_D-Infinity_Slope_Grid",
        "description": [
          "A grid of slope evaluated using the D-infinity method described in Tarboton, D. G., (1997), \"A New Method for the Determination of Flow Directions and Contributing Areas in Grid Digital Elevation Models,\" Water Resources Research, 33(2): 309-319. This is the steepest outwards slope on one of eight triangular facets centered at each grid cell, measured as drop/distance, i.e. tan of the slope angle."
        ],
        "dataType": "Raster Dataset",
        "isOptional": false,
        "isInputFile": false,
        "isOutputFile": true
      }
    ],
    "options": [
      {
        "parameterName": "Input_Number_of_Processes",
        "description": [
          "The number of stripes that the domain will be divided into and the number of MPI parallel processes that will be spawned to evaluate each of the stripes."
        ],
        "dataType": "Long",
        "isOptional": true,
        "isInputFile": false,
        "isOutputFile": false
      }
    ]
  }
]